RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
/**
 *******************************************************************************
 * @file  hc32_ll_mcan.c
 * @brief This file provides firmware functions to manage the MCAN.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2023-05-31       CDT             First version
   2023-12-15       CDT             Optimized driver:
                                    1. Integrated stc_mcan_classic_config_t and stc_mcan_fd_config_t into stc_mcan_bit_time_config_t
                                    2. Integrated u32FdIso into u32FrameFormat.
                                    3. Removed API MCAN_SetFdIsoOperation(), added API MCAN_SetFrameFormat().
                                    4. Optimized the handling of the parameter stc_mcan_filter_t.u32FilterIndex
                                    5. Add 5 APIs for better get protocol status(register PSR):
                                       MCAN_GetTdcValue(), MCAN_GetDataLastErrorCode(), MCAN_GetLastErrorCode(),
                                       MCAN_GetComState(), MCAN_GetProtocolFlagStatus()
                                    6. Changed u8Activity of stc_mcan_protocol_status_t to u8ComState.
                                    7. Changed u8MsgStorageIndex of stc_mcan_hpm_status_t to u8MsgIndex.
                                    8. Optimized local function MCAN_FilterInitConfig()
                                    9. When the frame to be transmitted is a remote frame, do not write the data field to the message RAM.
                                       When the received frame is a remote frame, do not read the data field from the message RAM.
                                    Optimized comments.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_mcan.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_MCAN MCAN
 * @brief MCAN Driver Library
 * @{
 */

#if (LL_MCAN_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup MCAN_Local_Macros MCAN Local Macros
 * @{
 */

/**
 * @defgroup MCAN_Private_Constants MCAN Private Constants
 * @{
 */
#define MCAN_TIMEOUT_COUNT              (100U)
#define MCAN_TIMEOUT_VALUE              (SystemCoreClock / 1000UL)

#define MCAN_DATA_SIZE_MIN              (MCAN_DATA_SIZE_8BYTE)
#define MCAN_DATA_SIZE_MAX              (MCAN_DATA_SIZE_64BYTE)

#define CAN20_DATA_SIZE_MAX             (8U)

#define MCAN_STD_FILTER_NUM_MAX         (128U)
#define MCAN_EXT_FILTER_NUM_MAX         (64U)
#define MCAN_RX_FIFO0_NUM_MAX           (64U)
#define MCAN_RX_FIFO1_NUM_MAX           (64U)
#define MCAN_RX_BUF_NUM_MAX             (64U)
#define MCAN_TX_EVT_NUM_MAX             (32U)
#define MCAN_TX_ELMT_NUM_MAX            (32U)

#define MCAN_FRAME_ESI_POS              (31U)       /*!< Position of Error State Indicator */
#define MCAN_FRAME_ANMF_POS             (31U)
#define MCAN_FRAME_XTD_POS              (30U)       /*!< Position of Extended ID */
#define MCAN_FRAME_RTR_POS              (29U)       /*!< Position of Remote Transmission Request */
#define MCAN_FRAME_MM_L_POS             (24U)       /*!< Position of Message Marker */
#define MCAN_FRAME_FIDX_POS             (24U)
#define MCAN_FRAME_EFC_POS              (23U)
#define MCAN_FRAME_TSCE_POS             (22U)
#define MCAN_FRAME_ET_POS               (22U)       /*!< Position of Event type */
#define MCAN_FRAME_FDF_POS              (21U)       /*!< Position of FD Format */
#define MCAN_FRAME_BRS_POS              (20U)       /*!< Position of Bit Rate Switch */
#define MCAN_FRAME_STDID_POS            (18U)       /*!< Position of Standard ID */
#define MCAN_FRAME_DLC_POS              (16U)       /*!< Position of Data Length Code */
#define MCAN_FRAME_MM_H_POS             (8U)        /*!< Position of Message Marker */

#define MCAN_FRAME_ESI_MASK             (1UL << MCAN_FRAME_ESI_POS)
#define MCAN_FRAME_ANMF_MASK            (1UL << MCAN_FRAME_ANMF_POS)
#define MCAN_FRAME_XTD_MASK             (1UL << MCAN_FRAME_XTD_POS)
#define MCAN_FRAME_RTR_MASK             (1UL << MCAN_FRAME_RTR_POS)
#define MCAN_FRAME_MM_L_MASK            (0xFFUL << MCAN_FRAME_MM_L_POS)
#define MCAN_FRAME_FIDX_MASK            (0x7FUL << MCAN_FRAME_FIDX_POS)
#define MCAN_FRAME_EFC_MASK             (1UL << MCAN_FRAME_EFC_POS)
#define MCAN_FRAME_TSCE_MASK            (1UL << MCAN_FRAME_TSCE_POS)
#define MCAN_FRAME_ET_MASK              (3UL << MCAN_FRAME_ET_POS)
#define MCAN_FRAME_FDF_MASK             (1UL << MCAN_FRAME_FDF_POS)
#define MCAN_FRAME_BRS_MASK             (1UL << MCAN_FRAME_BRS_POS)
#define MCAN_FRAME_STDID_MASK           (MCAN_STD_ID_MASK << MCAN_FRAME_STDID_POS)
#define MCAN_FRAME_EXTID_MASK           (MCAN_EXT_ID_MASK)
#define MCAN_FRAME_DLC_MASK             (0xFUL << MCAN_FRAME_DLC_POS)
#define MCAN_FRAME_MM_H_MASK            (0xFFUL << MCAN_FRAME_MM_H_POS)
#define MCAN_FRAME_TS_MASK              (0x0000FFFFUL)

#define MCAN_FILTER_SFTYPE_POS          (30U)
#define MCAN_FILTER_SFCFG_POS           (27U)
#define MCAN_FILTER_SFID1_POS           (16U)
#define MCAN_FILTER_SFDBGMSG_POS        (9U)

