RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
#define MCAN_FILTER_EFTYPE_POS          (30U)
#define MCAN_FILTER_EFCFG_POS           (29U)

/* Allocate start address of each part */
#define MCAN_STD_FILTER_SA(u)           (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->SIDFC, MCAN_SIDFC_FLSSA))
#define MCAN_EXT_FILTER_SA(u)           (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->XIDFC, MCAN_XIDFC_FLESA))
#define MCAN_RX_FIFO0_SA(u)             (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->RXF0C, MCAN_RXF0C_F0SA))
#define MCAN_RX_FIFO1_SA(u)             (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->RXF1C, MCAN_RXF1C_F1SA))
#define MCAN_RX_BUF_SA(u)               (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->RXBC, MCAN_RXBC_RBSA))
#define MCAN_TX_EVT_FIFO_SA(u)          (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->TXEFC, MCAN_TXEFC_EFSA))
#define MCAN_TX_ELMT_SA(u)              (MCAN_MSG_RAM_BASE + READ_REG32_BIT((u)->TXBC, MCAN_TXBC_TBSA))

/* Allocate number of each part */
#define MCAN_GET_STD_FILTER_NUM(u)      (READ_REG32_BIT((u)->SIDFC, MCAN_SIDFC_LSS) >> MCAN_SIDFC_LSS_POS)
#define MCAN_GET_EXT_FILTER_NUM(u)      (READ_REG32_BIT((u)->XIDFC, MCAN_XIDFC_LSE) >> MCAN_XIDFC_LSE_POS)
#define MCAN_GET_RX_FIFO0_NUM(u)        (READ_REG32_BIT((u)->RXF0C, MCAN_RXF0C_F0S) >> MCAN_RXF0C_F0S_POS)
#define MCAN_GET_RX_FIFO1_NUM(u)        (READ_REG32_BIT((u)->RXF1C, MCAN_RXF1C_F1S) >> MCAN_RXF1C_F1S_POS)
#define MCAN_GET_TX_EVT_FIFO_NUM(u)     (READ_REG32_BIT((u)->TXEFC, MCAN_TXEFC_EFS) >> MCAN_TXEFC_EFS_POS)
#define MCAN_GET_TX_BUF_NUM(u)          (READ_REG32_BIT((u)->TXBC, MCAN_TXBC_NDTB) >> MCAN_TXBC_NDTB_POS)
#define MCAN_GET_TX_FQ_NUM(u)           (READ_REG32_BIT((u)->TXBC, MCAN_TXBC_TFQS) >> MCAN_TXBC_TFQS_POS)

/* Data field size */
#define MCAN_RX_FIFO0_DS(u)             (READ_REG32_BIT((u)->RXESC, MCAN_RXESC_F0DS))
#define MCAN_RX_FIFO1_DS(u)             (READ_REG32_BIT((u)->RXESC, MCAN_RXESC_F1DS) >> MCAN_RXESC_F1DS_POS)
#define MCAN_RX_BUF_DS(u)               (READ_REG32_BIT((u)->RXESC, MCAN_RXESC_RBDS) >> MCAN_RXESC_RBDS_POS)
#define MCAN_TX_DS(u)                   (READ_REG32_BIT((u)->TXESC, MCAN_TXESC_TBDS))

/* Element size */
#define MCAN_STD_FILTER_ES              (4U)
#define MCAN_EXT_FILTER_ES              (8U)
#define MCAN_TX_EVT_ES                  (8U)
#define MCAN_RX_FIFO0_ES(u)             ((uint32_t)m_au8ElmtSize[MCAN_RX_FIFO0_DS(u)])
#define MCAN_RX_FIFO1_ES(u)             ((uint32_t)m_au8ElmtSize[MCAN_RX_FIFO1_DS(u)])
#define MCAN_RX_BUF_ES(u)               ((uint32_t)m_au8ElmtSize[MCAN_RX_BUF_DS(u)])
#define MCAN_TX_ES(u)                   ((uint32_t)m_au8ElmtSize[MCAN_TX_DS(u)])

#define MCAN_GET_ES(ds)                 ((uint32_t)m_au8ElmtSize[(ds)])

#define MCAN_RX_FIFO0_REAL_DS(u)        m_au8DLC2Size[MCAN_RX_FIFO0_DS(u) + 8U]
#define MCAN_RX_FIFO1_REAL_DS(u)        m_au8DLC2Size[MCAN_RX_FIFO1_DS(u) + 8U]
#define MCAN_RX_BUF_REAL_DS(u)          m_au8DLC2Size[MCAN_RX_BUF_DS(u) + 8U]
#define MCAN_TX_REAL_DS(u)              m_au8DLC2Size[MCAN_TX_DS(u) + 8U]

#define GET_BIT_POS(val)                (__CLZ(__RBIT(val)))

/**
 * @}
 */

/**
 * @defgroup MCAN_Check_Parameters_Validity MCAN Check Parameters Validity
 * @{
 */
#define IS_MCAN_BIT_MASK(x, mask)       (((x) != 0U) && (((x) | (mask)) == (mask)))

#define IS_ADC_1BIT_MASK(x)             (((x) != 0U) && (((x) & ((x) - 1U)) == 0U))

#define IS_MCAN_FUNC_EN(x, en)          (((x) == 0U) || ((x) == (en)))

#define IS_MCAN_RANGE(x, min, max)      (((x) >= (min)) && ((x) <= (max)))

/* MCAN unit */
#define IS_MCAN_UNIT(x)                 (((x) == CM_MCAN1) || ((x) == CM_MCAN2))

/* MCAN operating mode */
#define IS_MCAN_MD(x)                                                           \
(   ((x) == MCAN_MD_NORMAL)             ||                                      \
    ((x) == MCAN_MD_RESTRICTED_OP)      ||                                      \
    ((x) == MCAN_MD_BUS_MON)            ||                                      \
    ((x) == MCAN_MD_INTERN_LOOPBACK)    ||                                      \
    ((x) == MCAN_MD_EXTERN_LOOPBACK))

/* MCAN frame format */
#define IS_MCAN_FRAME_FORMAT(x)                                                 \
(   ((x) == MCAN_FRAME_CLASSIC)             ||                                  \
    ((x) == MCAN_FRAME_ISO_FD_NO_BRS)       ||                                  \
    ((x) == MCAN_FRAME_ISO_FD_BRS)          ||                                  \
    ((x) == MCAN_FRAME_NON_ISO_FD_NO_BRS)   ||                                  \
    ((x) == MCAN_FRAME_NON_ISO_FD_BRS))

/* Nominal bit time */
#define IS_MCAN_NBRP(x)                 IS_MCAN_RANGE(x, 1U, 512U)
#define IS_MCAN_NSEG1(x)                IS_MCAN_RANGE(x, 3U, 257U)
#define IS_MCAN_NSEG2(x)                IS_MCAN_RANGE(x, 2U, 128U)
#define IS_MCAN_NSJW(x)                 IS_MCAN_RANGE(x, 1U, 128U)

/* FD data bit time */
#define IS_MCAN_DBRP(tdc, x)                                                    \
(   (((tdc) == MCAN_FD_TDC_DISABLE) && IS_MCAN_RANGE(x, 1U, 32U))           ||  \
    (((tdc) == MCAN_FD_TDC_ENABLE) && IS_MCAN_RANGE(x, 1U, 2U)))
#define IS_MCAN_DSEG1(x)                IS_MCAN_RANGE(x, 2U, 33U)
#define IS_MCAN_DSEG2(x)                IS_MCAN_RANGE(x, 1U, 16U)
#define IS_MCAN_DSJW(x)                 IS_MCAN_RANGE(x, 1U, 16U)

/* FD data SSP offset */
#define IS_MCAN_SSP(x)                  ((x) <= 127U)
#define IS_MCAN_TDC_FILTER(x)           ((x) <= 127U)

/* MCAN Automatic Retransmission */
#define IS_MCAN_AUTO_RETX_EN(x)                                                 \
(   ((x) == MCAN_AUTO_RETX_DISABLE)     ||                                      \
    ((x) == MCAN_AUTO_RETX_ENABLE))

/* MCAN transmit pause */
#define IS_MCAN_TX_PAUSE_EN(x)                                                  \
(   ((x) == MCAN_TX_PAUSE_DISABLE)      ||                                      \
    ((x) == MCAN_TX_PAUSE_ENABLE))

/* MCAN Tx event message marker */
#define IS_MCAN_MSG_MARKER_CFG(x)                                               \
(   ((x) == MCAN_MSG_MARKER_8BIT)       ||                                      \
    ((x) == MCAN_MSG_MARKER_16BIT))

/* MCAN protocol exception handling */
#define IS_MCAN_PXH_EN(x)                                                       \
(   ((x) == MCAN_PROTOCOL_EXP_DISABLE)  ||                                      \
    ((x) == MCAN_PROTOCOL_EXP_ENABLE))

/* MCAN Tx pin control */
#define IS_MCAN_PIN_CTRL(x)                                                     \
(   ((x) == MCAN_TX_PIN_NORMAL)         ||                                      \
    ((x) == MCAN_TX_PIN_MONITOR)        ||                                      \
    ((x) == MCAN_TX_PIN_DOMINANT)       ||                                      \
    ((x) == MCAN_TX_PIN_RECESSIVE))

/* MCAN message RAM */
#define IS_MCAN_MSG_RAM_OFFSET_ADDR(x)  ((((x) & 0x3UL) == 0U) && ((x) < MCAN_MSG_RAM_SIZE))
#define IS_MCAN_STD_FILTER_NUM(x)       ((x) <= MCAN_STD_FILTER_NUM_MAX)
#define IS_MCAN_EXT_FILTER_NUM(x)       ((x) <= MCAN_EXT_FILTER_NUM_MAX)
#define IS_MCAN_RX_FIFO0_NUM(x)         ((x) <= MCAN_RX_FIFO0_NUM_MAX)
#define IS_MCAN_RX_FIFO1_NUM(x)         ((x) <= MCAN_RX_FIFO1_NUM_MAX)
#define IS_MCAN_RX_BUF_NUM(x)           ((x) <= MCAN_RX_BUF_NUM_MAX)
#define IS_MCAN_TX_EVT_NUM(x)           ((x) <= MCAN_TX_EVT_NUM_MAX)
#define IS_MCAN_TX_ELMT_NUM(x)          ((x) <= MCAN_TX_ELMT_NUM_MAX)
#define IS_MCAN_MSG_RAM_END_ADDR(x)     ((x) <= MCAN_MSG_RAM_END)

/* MCAN data field size */
#define IS_MCAN_DATA_FIELD_SIZE(x)      ((x) <= MCAN_DATA_SIZE_MAX)

/* Tx FIFO/Queue operation mode */
#define IS_MCAN_TX_FIFO_QUEUE_MD(x)     (((x) == MCAN_TX_FIFO_MD) || ((x) == MCAN_TX_QUEUE_MD))

/* MCAN filter */
#define IS_MCAN_ID_TYPE(x)              (((x) == MCAN_STD_ID) || ((x) == MCAN_EXT_ID))
#define IS_MCAN_STD_ID_VAL(x)           ((x) <= MCAN_STD_ID_MASK)
#define IS_MCAN_EXT_ID_VAL(x)           ((x) <= MCAN_EXT_ID_MASK)

#define IS_MCAN_STD_FILTER_TYPE(x)                                              \
(   ((x) == MCAN_FILTER_RANGE)          ||                                      \
    ((x) == MCAN_FILTER_DUAL )          ||                                      \
    ((x) == MCAN_FILTER_MASK))

