RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
#define IS_MCAN_EXT_FILTER_TYPE(x)                                              \
(   ((x) == MCAN_FILTER_RANGE)          ||                                      \
    ((x) == MCAN_FILTER_DUAL)           ||                                      \
    ((x) == MCAN_FILTER_MASK)           ||                                      \
    ((x) == MCAN_FILTER_RANGE_NO_EIDM))

#define IS_MCAN_FILTER_CFG(x)                                                   \
(   ((x) == MCAN_FILTER_DISABLE)        ||                                      \
    ((x) == MCAN_FILTER_TO_RX_FIFO0)    ||                                      \
    ((x) == MCAN_FILTER_TO_RX_FIFO1)    ||                                      \
    ((x) == MCAN_FILTER_REJECT)         ||                                      \
    ((x) == MCAN_FILTER_HP_NO_STORAGE)  ||                                      \
    ((x) == MCAN_FILTER_HP_TO_RX_FIFO0) ||                                      \
    ((x) == MCAN_FILTER_HP_TO_RX_FIFO1) ||                                      \
    ((x) == MCAN_FILTER_TO_RX_BUF))

/* Non-matching frame operation */
#define IS_MCAN_NMF_OP(x)                                                       \
(   ((x) == MCAN_NMF_ACCEPT_IN_RX_FIFO0)    ||                                  \
    ((x) == MCAN_NMF_ACCEPT_IN_RX_FIFO1)    ||                                  \
    ((x) == MCAN_NMF_REJECT))

/* Remote frame operation */
#define IS_MCAN_REMOTE_FRAME_OP(x)                                              \
(   ((x) == MCAN_REMOTE_FRAME_FILTER)   ||                                      \
    ((x) == MCAN_REMOTE_FRAME_REJECT ))

/* Rx FIFO */
#define IS_MCAN_RX_FIFO(x)                                                      \
(   ((x) == MCAN_RX_FIFO0)              ||                                      \
    ((x) == MCAN_RX_FIFO1))

/* Rx FIFO operation mode */
#define IS_MCAN_RX_FIFO_MD(x)                                                   \
(   ((x) == MCAN_RX_FIFO_BLOCKING)      ||                                      \
    ((x) == MCAN_RX_FIFO_OVERWRITE))

/* Watermark FIFO */
#define IS_MCAN_WATERMARK_FIFO(x)                                               \
(   ((x) == MCAN_WATERMARK_TX_EVT_FIFO) ||                                      \
    ((x) == MCAN_WATERMARK_RX_FIFO0)    ||                                      \
    ((x) == MCAN_WATERMARK_RX_FIFO1))

/* RAM watchdog counter start value */
#define IS_MCAN_RAM_WDT_START_VAL(x)    ((x) <= 255U)

/* MCAN timestamp counter */
#define IS_MCAN_TS_PRESC(x)             (((x) >= 1U) && ((x) <= 16U ))

/* MCAN timeout counter */
#define IS_MCAN_TO_SEL(x)                                                       \
(   ((x) == MCAN_TIMEOUT_CONT)          ||                                      \
    ((x) == MCAN_TIMEOUT_TX_EVT_FIFO)   ||                                      \
    ((x) == MCAN_TIMEOUT_RX_FIFO0)      ||                                      \
    ((x) == MCAN_TIMEOUT_RX_FIFO1))

#define IS_MCAN_TO_PERIOD(x)            ((x) <= 65535U)

/* MCAN frame bit field */
#define IS_MCAN_FRAME_RTR(x)            (((x) == 0U) || ((x) == 1U))
#define IS_MCAN_FRAME_DLC(x)            ((x) <= MCAN_DLC64)
#define IS_MCAN_FRAME_ESI(x)            (((x) == 0U) || ((x) == 1U))
#define IS_MCAN_FRAME_BRS(x)            (((x) == 0U) || ((x) == 1U))
#define IS_MCAN_FRAME_FDF(x)            (((x) == 0U) || ((x) == 1U))
#define IS_MCAN_FRAME_EFC(x)            (((x) == 0U) || ((x) == 1U))

#define IS_MCAN_FRAME_MSG_MARKER(wmm, x)                                        \
(   (((wmm) == 0U) && ((x) <= 255UL))   ||                                      \
    (((wmm) != 0U) && ((x) <= 65535UL)))

/* One Tx buffer check */
#define IS_MCAN_1TXBUF(x)               IS_ADC_1BIT_MASK(x)
#define IS_MCAN_TX_BUF(x)               IS_MCAN_BIT_MASK(x, MCAN_TX_BUF_ALL)

/* Interrupt */
#define IS_MCAN_INT_LINE(x)                                                     \
(   ((x) == MCAN_INT_LINE0)             ||                                      \
    ((x) == MCAN_INT_LINE1))
#define IS_MCAN_INT_TYPE(x)             IS_MCAN_BIT_MASK(x, MCAN_INT_ALL)
#define IS_MCAN_TX_BUF_NOTICE(x)        IS_MCAN_BIT_MASK(x, MCAN_INT_TX_CPLT | MCAN_INT_TX_ABORT_CPLT)

/* Interrupt flag */
#define IS_MCAN_FLAG(x)                 IS_MCAN_BIT_MASK(x, MCAN_FLAG_ALL)

/* Protocol status flag */
#define IS_MCAN_PS_FLAG(x)              IS_MCAN_BIT_MASK(x, MCAN_PROTOCOL_FLAG_ALL)

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup MCAN_Local_Variables MCAN Local Variables
 * @{
 */
static const uint8_t m_au8DLC2Size[16U] = {
    0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U
};

static const uint8_t m_au8ElmtSize[8U] = {16U, 20U, 24U, 28U, 32U, 40U, 56U, 72U};

/**
 * @}
 */

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup MCAN_Local_Functions MCAN Local Functions
 * @{
 */

/**
 * @brief  Specifies MCAN operating mode.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32Mode                MCAN operating mode.
 *                                      This parameter can be a value of @ref MCAN_Operating_Mode
 *   @arg  MCAN_MD_NORMAL:              Normal mode.
 *   @arg  MCAN_MD_RESTRICTED_OP:       Restricted operation mode.
 *   @arg  MCAN_MD_BUS_MON:             Bus monitoring mode.
 *   @arg  MCAN_MD_INTERN_LOOPBACK:     Internal loopBack mode.
 *   @arg  MCAN_MD_EXTERN_LOOPBACK:     External loopBack mode.
 * @retval None
 */
static void MCAN_SetMode(CM_MCAN_TypeDef *MCANx, uint32_t u32Mode)
{
    /* Set MCAN operating mode:
       |----------------------|-----------|----------|-----------|----------|
       |                      | CCCR.TEST | CCCR.MON | TEST.LBCK | CCCR.ASM |
       |----------------------|-----------|----------|-----------|----------|
       | Normal               |     0     |     0    |     0     |    0     |
       |----------------------|-----------|----------|-----------|----------|
       | Restricted Operation |     0     |     0    |     0     |    1     |
       |----------------------|-----------|----------|-----------|----------|
       | Bus Monitoring       |     0     |     1    |     0     |    0     |
       |----------------------|-----------|----------|-----------|----------|
       | Internal LoopBack    |     1     |     1    |     1     |    0     |
       |----------------------|-----------|----------|-----------|----------|
       | External LoopBack    |     1     |     0    |     1     |    0     |
       |----------------------|-----------|----------|-----------|----------|
    */
    /* Default mode: normal mode */
    CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_TEST | MCAN_CCCR_MON | MCAN_CCCR_ASM);
    CLR_REG32_BIT(MCANx->TEST, MCAN_TEST_LBCK);
    /* Switch mode according to the parameter u32Mode */
    switch (u32Mode) {
        case MCAN_MD_RESTRICTED_OP:
            SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_ASM);
            break;
        case MCAN_MD_BUS_MON:
            SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_MON);
            break;
        case MCAN_MD_INTERN_LOOPBACK:
            SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_TEST | MCAN_CCCR_MON);
            SET_REG32_BIT(MCANx->TEST, MCAN_TEST_LBCK);
            break;
        case MCAN_MD_EXTERN_LOOPBACK:
            SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_TEST);
            SET_REG32_BIT(MCANx->TEST, MCAN_TEST_LBCK);
            break;
        default:
            /* Nothing to do: normal mode */
            break;
    }
}

/**
 * @brief  Configures MCAN message RAM.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pstcMsgRam             Pointer to a @ref stc_mcan_msg_ram_config_t type structure
 *                                      which contains the message RAM configuration information.
 * @retval None
 */
static void MCAN_MsgRamInitConfig(CM_MCAN_TypeDef *MCANx, stc_mcan_msg_ram_config_t *pstcMsgRam)
{
    uint32_t u32EndAddr;
    uint32_t u32StartAddr = pstcMsgRam->u32AddrOffset;
    uint32_t u32TxElmtNum = pstcMsgRam->u32TxBufferNum + pstcMsgRam->u32TxFifoQueueNum;

    /* Start address(offset address) 4byte alignment required */
    DDL_ASSERT(IS_MCAN_MSG_RAM_OFFSET_ADDR(u32StartAddr));
    DDL_ASSERT(IS_MCAN_STD_FILTER_NUM(pstcMsgRam->u32StdFilterNum));
    DDL_ASSERT(IS_MCAN_EXT_FILTER_NUM(pstcMsgRam->u32ExtFilterNum));
    DDL_ASSERT(IS_MCAN_RX_FIFO0_NUM(pstcMsgRam->u32RxFifo0Num));
    DDL_ASSERT(IS_MCAN_RX_FIFO1_NUM(pstcMsgRam->u32RxFifo1Num));
    DDL_ASSERT(IS_MCAN_RX_BUF_NUM(pstcMsgRam->u32RxBufferNum));
    DDL_ASSERT(IS_MCAN_TX_EVT_NUM(pstcMsgRam->u32TxEventNum));
    DDL_ASSERT(IS_MCAN_TX_ELMT_NUM(u32TxElmtNum));

    /* Standard filter start address and elements number */
    WRITE_REG32(MCANx->SIDFC, u32StartAddr);
    SET_REG32_BIT(MCANx->SIDFC, (pstcMsgRam->u32StdFilterNum << MCAN_SIDFC_LSS_POS));

    /* Extended filter start address and elements number */
    u32StartAddr += (pstcMsgRam->u32StdFilterNum * MCAN_STD_FILTER_ES);
    WRITE_REG32(MCANx->XIDFC, (pstcMsgRam->u32ExtFilterNum << MCAN_XIDFC_LSE_POS) | u32StartAddr);

    /* Rx FIFO0 start address and elements number */
    u32StartAddr += (pstcMsgRam->u32ExtFilterNum * MCAN_EXT_FILTER_ES);
    WRITE_REG32(MCANx->RXF0C, (pstcMsgRam->u32RxFifo0Num << MCAN_RXF0C_F0S_POS) | u32StartAddr);

    /* Rx FIFO1 start address and elements number */
    u32StartAddr += (pstcMsgRam->u32RxFifo0Num * MCAN_GET_ES(pstcMsgRam->u32RxFifo0DataSize));
    WRITE_REG32(MCANx->RXF1C, (pstcMsgRam->u32RxFifo1Num << MCAN_RXF1C_F1S_POS) | u32StartAddr);

    /* Rx buffer list start address */
    u32StartAddr += (pstcMsgRam->u32RxFifo1Num * MCAN_GET_ES(pstcMsgRam->u32RxFifo1DataSize));
    WRITE_REG32(MCANx->RXBC, u32StartAddr);

    /* Tx event FIFO start address and elements number */
    u32StartAddr += (pstcMsgRam->u32RxBufferNum * MCAN_GET_ES(pstcMsgRam->u32RxBufferDataSize));
    WRITE_REG32(MCANx->TXEFC, (pstcMsgRam->u32TxEventNum << MCAN_TXEFC_EFS_POS) | u32StartAddr);

    /* Tx buffer list start address, dedicated Tx buffers number, Tx FIFO/queue elements number */
    u32StartAddr += (pstcMsgRam->u32TxEventNum * MCAN_TX_EVT_ES);
    WRITE_REG32(MCANx->TXBC, (pstcMsgRam->u32TxFifoQueueNum << MCAN_TXBC_TFQS_POS) | \
                (pstcMsgRam->u32TxBufferNum << MCAN_TXBC_NDTB_POS) | \
                u32StartAddr);
    u32StartAddr += (u32TxElmtNum * MCAN_GET_ES(pstcMsgRam->u32TxDataSize));
    /* Get total allocated size */
    pstcMsgRam->u32AllocatedSize = u32StartAddr - pstcMsgRam->u32AddrOffset;

    /* Message RAM end address */
    u32EndAddr = MCAN_MSG_RAM_BASE + u32StartAddr;
    /* Assert the end address is not out of range. */
    DDL_ASSERT(IS_MCAN_MSG_RAM_END_ADDR(u32EndAddr));

    /* Configure Rx FIFO0, Rx FIFO1 and Rx buffer data filed size */
    if (pstcMsgRam->u32RxFifo0Num > 0U) {
        DDL_ASSERT(IS_MCAN_DATA_FIELD_SIZE(pstcMsgRam->u32RxFifo0DataSize));
        MODIFY_REG32(MCANx->RXESC, MCAN_RXESC_F0DS, (pstcMsgRam->u32RxFifo0DataSize << MCAN_RXESC_F0DS_POS));
    }
    if (pstcMsgRam->u32RxFifo1Num > 0U) {
        DDL_ASSERT(IS_MCAN_DATA_FIELD_SIZE(pstcMsgRam->u32RxFifo1DataSize));
        MODIFY_REG32(MCANx->RXESC, MCAN_RXESC_F1DS, (pstcMsgRam->u32RxFifo1DataSize << MCAN_RXESC_F1DS_POS));
    }
    if (pstcMsgRam->u32RxBufferNum > 0U) {
        DDL_ASSERT(IS_MCAN_DATA_FIELD_SIZE(pstcMsgRam->u32RxBufferDataSize));
        MODIFY_REG32(MCANx->RXESC, MCAN_RXESC_RBDS, (pstcMsgRam->u32RxBufferDataSize << MCAN_RXESC_RBDS_POS));
    }

    /* Configure Tx data filed size */
    if (u32TxElmtNum > 0U) {
        DDL_ASSERT(IS_MCAN_DATA_FIELD_SIZE(pstcMsgRam->u32TxDataSize));
        WRITE_REG32(MCANx->TXESC, pstcMsgRam->u32TxDataSize);

        if (pstcMsgRam->u32TxFifoQueueNum > 0U) {
            DDL_ASSERT(IS_MCAN_TX_FIFO_QUEUE_MD(pstcMsgRam->u32TxFifoQueueMode));
            MODIFY_REG32(MCANx->TXBC, MCAN_TXBC_TFQM, pstcMsgRam->u32TxFifoQueueMode);
        }
    }

    /* Flush the allocated Message RAM area */
    u32StartAddr = pstcMsgRam->u32AddrOffset + MCAN_MSG_RAM_BASE;
    while (u32StartAddr < u32EndAddr) {
        RW_MEM32(u32StartAddr) = 0x0UL;
        u32StartAddr += 4UL;
    }
}

/**
 * @brief  Configures MCAN acceptance filters when initializing the MCAN module.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pstcFilter             Pointer to a @ref stc_mcan_filter_config_t type structure which
 *                                      contains the acceptance filters configuration information.
 * @retval None
 */
static void MCAN_FilterInitConfig(CM_MCAN_TypeDef *MCANx, stc_mcan_filter_config_t *pstcFilter)
{
    uint32_t i;

    if (pstcFilter->pstcStdFilterList != NULL) {
        for (i = 0U; i < pstcFilter->u32StdFilterConfigNum; i++) {
            pstcFilter->pstcStdFilterList[i].u32FilterIndex = i;
            (void)MCAN_FilterConfig(MCANx, &pstcFilter->pstcStdFilterList[i]);
        }
    }

    if (pstcFilter->pstcExtFilterList != NULL) {
        for (i = 0U; i < pstcFilter->u32ExtFilterConfigNum; i++) {
            pstcFilter->pstcExtFilterList[i].u32FilterIndex = i;
            (void)MCAN_FilterConfig(MCANx, &pstcFilter->pstcExtFilterList[i]);
        }
    }
}

/**
 * @brief  Copy Tx message to the message RAM.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pTxMsg                 Pointer to a @ref stc_mcan_tx_msg_t structure that contains
 *                                      the information of the message that to be transmitted.
 * @param  [in]  u32TxPutIndex          Index of the Tx buffer to be configured.
 * @retval None
 */
static void MCAN_CopyTxMsgToRam(CM_MCAN_TypeDef *MCANx, stc_mcan_tx_msg_t *pTxMsg, uint32_t u32TxPutIndex)
{
    uint8_t i;
    uint32_t u32T0;
    uint32_t u32T1;
    uint32_t u32TxAddr;
    uint32_t u32MsgMarkerCfg;
    uint32_t u32DataSize;

    /* Build first word of Tx header element */
    if (pTxMsg->IDE == MCAN_STD_ID) {
        /* Standard frame */
        u32T0 = ((pTxMsg->ESI << MCAN_FRAME_ESI_POS) | \
                 (pTxMsg->RTR << MCAN_FRAME_RTR_POS) | \
                 (pTxMsg->ID << MCAN_FRAME_STDID_POS));
    } else {
        /* Extended frame */
        u32T0 = ((pTxMsg->ESI << MCAN_FRAME_ESI_POS) | \
                 (pTxMsg->IDE << MCAN_FRAME_XTD_POS) | \
                 (pTxMsg->RTR << MCAN_FRAME_RTR_POS) | \
                 pTxMsg->ID);
    }

    u32MsgMarkerCfg = pTxMsg->u32MsgMarker << MCAN_FRAME_MM_L_POS;
    if (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_WMM) != 0U) {
        u32MsgMarkerCfg |= (pTxMsg->u32MsgMarker & MCAN_FRAME_MM_H_MASK);
    }
    /* Build second word of Tx header element */
    u32T1 = (u32MsgMarkerCfg | \
             (pTxMsg->u32StoreTxEvent << MCAN_FRAME_EFC_POS) | \
             (pTxMsg->FDF << MCAN_FRAME_FDF_POS) | \
             (pTxMsg->BRS << MCAN_FRAME_BRS_POS) | \
             (pTxMsg->DLC << MCAN_FRAME_DLC_POS));
    /* Calculate Tx element address */
    u32TxAddr  = MCAN_TX_ELMT_SA(MCANx);
    u32TxAddr += (u32TxPutIndex * MCAN_TX_ES(MCANx));

    /* Write Tx element header to the message RAM */
    RW_MEM32(u32TxAddr) = u32T0;
    u32TxAddr += 4U;
    RW_MEM32(u32TxAddr) = u32T1;

