RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    u32DataSize = m_au8DLC2Size[pTxMsg->DLC];
    /* Determine the CAN frame format: classical CAN or FD CAN */
    if (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_FDOE) == 0U) {
        /* Max 8 bytes for classical CAN */
        if (u32DataSize > CAN20_DATA_SIZE_MAX) {
            u32DataSize = CAN20_DATA_SIZE_MAX;
        }
    } else {
        DDL_ASSERT(u32DataSize <= MCAN_TX_REAL_DS(MCANx));
    }
    if (pTxMsg->RTR == 0U) {
        /* Write Tx payload to the message RAM */
        for (i = 0U; i < u32DataSize; i += 4U) {
            u32TxAddr += 4U;
            RW_MEM32(u32TxAddr) = (((uint32_t)pTxMsg->au8Data[i + 3U] << 24U) | \
                                   ((uint32_t)pTxMsg->au8Data[i + 2U] << 16U) | \
                                   ((uint32_t)pTxMsg->au8Data[i + 1U] << 8U)  | \
                                   (uint32_t)pTxMsg->au8Data[i]);
        }
    }
}

/**
 * @brief  Get the number of the Rx buffer that has an allocated area into the message RAM.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint32_t type value of the number of the Rx buffer
 */
static uint32_t MCAN_GetRxBufferNum(const CM_MCAN_TypeDef *MCANx)
{
    uint32_t u32Temp;
    /* Get Tx event FIFO start address */
    u32Temp = MCAN_TX_EVT_FIFO_SA(MCANx);
    /* Get Rx buffer size */
    u32Temp -= MCAN_RX_BUF_SA(MCANx);
    /* Get Rx buffer number */
    return (u32Temp / MCAN_RX_BUF_ES(MCANx));
}

/**
 * @}
 */

/**
 * @defgroup MCAN_Global_Functions MCAN Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified MCAN peripheral according to the specified parameters
 *         in the structure pstcMcanInit.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pstcMcanInit           Pointer to a @ref stc_mcan_init_t structure value that
 *                                      contains the configuration information for the MCAN.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcMcanInit == NULL
 */
int32_t MCAN_Init(CM_MCAN_TypeDef *MCANx, stc_mcan_init_t *pstcMcanInit)
{
    uint32_t u32Config;
    uint32_t u32Mask;
    int32_t i32Ret = LL_ERR_INVD_PARAM;
    __IO uint32_t u32TimeoutValue = MCAN_TIMEOUT_VALUE;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (pstcMcanInit != NULL) {
        DDL_ASSERT(IS_MCAN_MD(pstcMcanInit->u32Mode));
        DDL_ASSERT(IS_MCAN_FRAME_FORMAT(pstcMcanInit->u32FrameFormat));
        DDL_ASSERT(IS_MCAN_NBRP(pstcMcanInit->stcBitTime.u32NominalPrescaler));
        DDL_ASSERT(IS_MCAN_NSEG1(pstcMcanInit->stcBitTime.u32NominalTimeSeg1));
        DDL_ASSERT(IS_MCAN_NSEG2(pstcMcanInit->stcBitTime.u32NominalTimeSeg2));
        DDL_ASSERT(IS_MCAN_NSJW(pstcMcanInit->stcBitTime.u32NominalSyncJumpWidth));
        /* If FD enabled */
        if ((pstcMcanInit->u32FrameFormat & MCAN_CCCR_FDOE) == MCAN_CCCR_FDOE) {
            DDL_ASSERT(IS_MCAN_DBRP(pstcMcanInit->stcBitTime.u32TDC, \
                                    pstcMcanInit->stcBitTime.u32DataPrescaler));
            DDL_ASSERT(IS_MCAN_DSEG1(pstcMcanInit->stcBitTime.u32DataTimeSeg1));
            DDL_ASSERT(IS_MCAN_DSEG2(pstcMcanInit->stcBitTime.u32DataTimeSeg2));
            DDL_ASSERT(IS_MCAN_DSJW(pstcMcanInit->stcBitTime.u32DataSyncJumpWidth));
            if (pstcMcanInit->stcBitTime.u32TDC == MCAN_FD_TDC_ENABLE) {
                DDL_ASSERT(IS_MCAN_SSP(pstcMcanInit->stcBitTime.u32SspOffset));
                DDL_ASSERT(IS_MCAN_TDC_FILTER(pstcMcanInit->stcBitTime.u32TdcFilter));
            }
        }
        DDL_ASSERT(IS_MCAN_AUTO_RETX_EN(pstcMcanInit->u32AutoRetx));
        DDL_ASSERT(IS_MCAN_TX_PAUSE_EN(pstcMcanInit->u32TxPause));
        DDL_ASSERT(IS_MCAN_PXH_EN(pstcMcanInit->u32ProtocolException));

        if (pstcMcanInit->stcFilter.u32StdFilterConfigNum > 0U) {
            DDL_ASSERT(pstcMcanInit->stcFilter.u32StdFilterConfigNum <= \
                       (uint8_t)pstcMcanInit->stcMsgRam.u32StdFilterNum);
        }
        if (pstcMcanInit->stcFilter.u32ExtFilterConfigNum > 0U) {
            DDL_ASSERT(pstcMcanInit->stcFilter.u32ExtFilterConfigNum <= \
                       (uint8_t)pstcMcanInit->stcMsgRam.u32ExtFilterNum);
        }

        i32Ret = LL_OK;
        /* Exit from sleep mode */
        CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSR);
        /* Check sleep mode acknowledge */
        while (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSA) == MCAN_CCCR_CSA) {
            u32TimeoutValue--;
            if (u32TimeoutValue == 0u) {
                i32Ret = LL_ERR_TIMEOUT;
            }
        }

        if (i32Ret == LL_OK) {
            /* Request initialization */
            SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_INIT);
            /* Wait until the CCCR.INIT is set */
            u32TimeoutValue = MCAN_TIMEOUT_VALUE;
            while (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_INIT) == 0U) {
                u32TimeoutValue--;
                if (u32TimeoutValue == 0u) {
                    i32Ret = LL_ERR_TIMEOUT;
                }
            }
        }

        if (i32Ret == LL_OK) {
            /* Enable configuration change */
            SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CCE);

            /* Frame format, automatic retransmission, transmit pause, protocol exception handling */
            u32Mask   = MCAN_FRAME_NON_ISO_FD_BRS | MCAN_CCCR_DAR | MCAN_CCCR_TXP | MCAN_CCCR_PXHD;
            u32Config = pstcMcanInit->u32FrameFormat | pstcMcanInit->u32AutoRetx | \
                        pstcMcanInit->u32TxPause | pstcMcanInit->u32ProtocolException;
            MODIFY_REG32(MCANx->CCCR, u32Mask, u32Config);

            /* Nominal bit time */
            u32Config = ((pstcMcanInit->stcBitTime.u32NominalPrescaler - 1U) << MCAN_NBTP_NBRP_POS)     | \
                        ((pstcMcanInit->stcBitTime.u32NominalTimeSeg1 - 2U) << MCAN_NBTP_NTSEG1_POS)    | \
                        ((pstcMcanInit->stcBitTime.u32NominalSyncJumpWidth - 1U) << MCAN_NBTP_NSJW_POS) | \
                        (pstcMcanInit->stcBitTime.u32NominalTimeSeg2 - 1U);
            WRITE_REG32(MCANx->NBTP, u32Config);

            /* Data bit time */
            if ((pstcMcanInit->u32FrameFormat & MCAN_CCCR_FDOE) == MCAN_CCCR_FDOE) {
                u32Config = ((pstcMcanInit->stcBitTime.u32DataPrescaler - 1U) << MCAN_DBTP_DBRP_POS)  | \
                            ((pstcMcanInit->stcBitTime.u32DataTimeSeg1 - 2U) << MCAN_DBTP_DTSEG1_POS) | \
                            (pstcMcanInit->stcBitTime.u32DataSyncJumpWidth - 1U)                      | \
                            ((pstcMcanInit->stcBitTime.u32DataTimeSeg2 - 1U) << MCAN_DBTP_DTSEG2_POS);
                WRITE_REG32(MCANx->DBTP, u32Config);
                if (pstcMcanInit->stcBitTime.u32TDC == MCAN_FD_TDC_ENABLE) {
                    SET_REG32_BIT(MCANx->DBTP, pstcMcanInit->stcBitTime.u32TDC);
                    u32Config = (pstcMcanInit->stcBitTime.u32SspOffset << MCAN_TDCR_TDCO_POS) | \
                                pstcMcanInit->stcBitTime.u32TdcFilter;
                    WRITE_REG32(MCANx->TDCR, u32Config);
                }
            }

