RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
            /* MCAN operating mode */
            MCAN_SetMode(MCANx, pstcMcanInit->u32Mode);
            /* MCAN message RAM */
            MCAN_MsgRamInitConfig(MCANx, &pstcMcanInit->stcMsgRam);
            /* MCAN message filter */
            MCAN_FilterInitConfig(MCANx, &pstcMcanInit->stcFilter);
            /* Reject all non-matching frames. */
            WRITE_REG32(MCANx->GFC, 0x3FUL);
        }

        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Set each member of @ref stc_mcan_init_t to a default value.
 *         The default value for bit time is an example for application, based on the 40MHz MCAN clock.
 *         The default value set nominal bit rate to 500Kbps, set data bit rate to 4Mbps.
 *         Nominal prescaler: 1
 *         Nominal total TQs: 80
 *         Nominal time segment before sample point: 64
 *         Nominal time segment after sample point: 16
 *         Nominal (re)synchronization jump width: 16
 *         Nominal sample point: 80%
 *         Data prescaler: 1
 *         Data total TQs: 10
 *         Data time segment before sample point: 8
 *         Data time segment after sample point: 2
 *         Data (re)synchronization jump width: 2
 *         Data sample point: 80%
 * @param  [in]  pstcMcanInit           Pointer to a @ref stc_mcan_init_t structure
 *                                      whose members will be set to default values.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcMcanInit == NULL.
 */
int32_t MCAN_StructInit(stc_mcan_init_t *pstcMcanInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (pstcMcanInit != NULL) {
        pstcMcanInit->u32Mode              = MCAN_MD_NORMAL;
        pstcMcanInit->u32FrameFormat       = MCAN_FRAME_ISO_FD_BRS;
        pstcMcanInit->u32AutoRetx          = MCAN_AUTO_RETX_ENABLE;
        pstcMcanInit->u32TxPause           = MCAN_TX_PAUSE_DISABLE;
        pstcMcanInit->u32ProtocolException = MCAN_PROTOCOL_EXP_ENABLE;
        /* Nominal bit time, for classical CAN and CAN FD arbitration phase */
        pstcMcanInit->stcBitTime.u32NominalPrescaler     = 1U;
        pstcMcanInit->stcBitTime.u32NominalTimeSeg1      = 64U;
        pstcMcanInit->stcBitTime.u32NominalTimeSeg2      = 16U;
        pstcMcanInit->stcBitTime.u32NominalSyncJumpWidth = 16U;
        /* Data bit time, for CAN FD data phase */
        pstcMcanInit->stcBitTime.u32DataPrescaler        = 1U;
        pstcMcanInit->stcBitTime.u32DataTimeSeg1         = 8U;
        pstcMcanInit->stcBitTime.u32DataTimeSeg2         = 2U;
        pstcMcanInit->stcBitTime.u32DataSyncJumpWidth    = 2U;
        pstcMcanInit->stcBitTime.u32TDC                  = MCAN_FD_TDC_ENABLE;
        pstcMcanInit->stcBitTime.u32SspOffset            = 8U;
        pstcMcanInit->stcBitTime.u32TdcFilter            = 0U;
        /* Message RAM */
        pstcMcanInit->stcMsgRam.u32AddrOffset        = 0U;
        pstcMcanInit->stcMsgRam.u32StdFilterNum      = 0U;
        pstcMcanInit->stcMsgRam.u32ExtFilterNum      = 0U;
        pstcMcanInit->stcMsgRam.u32RxFifo0Num        = 0U;
        pstcMcanInit->stcMsgRam.u32RxFifo0DataSize   = MCAN_DATA_SIZE_8BYTE;
        pstcMcanInit->stcMsgRam.u32RxFifo1Num        = 0U;
        pstcMcanInit->stcMsgRam.u32RxFifo1DataSize   = MCAN_DATA_SIZE_8BYTE;
        pstcMcanInit->stcMsgRam.u32RxBufferNum       = 0U;
        pstcMcanInit->stcMsgRam.u32RxBufferDataSize  = MCAN_DATA_SIZE_8BYTE;
        pstcMcanInit->stcMsgRam.u32TxEventNum        = 0U;
        pstcMcanInit->stcMsgRam.u32TxBufferNum       = 0U;
        pstcMcanInit->stcMsgRam.u32TxFifoQueueNum    = 0U;
        pstcMcanInit->stcMsgRam.u32TxFifoQueueMode   = MCAN_TX_FIFO_MD;
        pstcMcanInit->stcMsgRam.u32TxDataSize        = MCAN_DATA_SIZE_8BYTE;
        /* Acceptance filter */
        pstcMcanInit->stcFilter.pstcStdFilterList     = NULL;
        pstcMcanInit->stcFilter.pstcExtFilterList     = NULL;
        pstcMcanInit->stcFilter.u32StdFilterConfigNum = 0U;
        pstcMcanInit->stcFilter.u32ExtFilterConfigNum = 0U;

        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Deinitialize the MCAN peripheral registers to their default reset values.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval None
 */
void MCAN_DeInit(CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    /* Stop the MCAN module: return value is voluntary ignored. */
    (void)MCAN_Stop(MCANx);
    /* Disable interrupt lines. */
    WRITE_REG32(MCANx->ILE, 0U);
    /* Set registers to their default reset values. */
    WRITE_REG32(MCANx->DBTP, 0x0A33U);
    WRITE_REG32(MCANx->TEST, 0x0U);
    WRITE_REG32(MCANx->RWD, 0x0U);
    WRITE_REG32(MCANx->CCCR, 0x3U);
    WRITE_REG32(MCANx->NBTP, 0x06000A03UL);
    WRITE_REG32(MCANx->TSCC, 0x0U);
    WRITE_REG32(MCANx->TOCC, 0x0U);
    WRITE_REG32(MCANx->TDCR, 0x0U);
    WRITE_REG32(MCANx->IR, 0x0U);
    WRITE_REG32(MCANx->IE, 0x0U);
    WRITE_REG32(MCANx->ILS, 0x0U);
    WRITE_REG32(MCANx->GFC, 0x0U);
    WRITE_REG32(MCANx->SIDFC, 0x0U);
    WRITE_REG32(MCANx->XIDFC, 0x0U);
    WRITE_REG32(MCANx->XIDAM, 0x1FFFFFFFUL);
    WRITE_REG32(MCANx->NDAT1, 0x0U);
    WRITE_REG32(MCANx->NDAT2, 0x0U);
    WRITE_REG32(MCANx->RXF0C, 0x0U);
    WRITE_REG32(MCANx->RXBC, 0x0U);
    WRITE_REG32(MCANx->RXF1C, 0x0U);
    WRITE_REG32(MCANx->RXESC, 0x0U);
    WRITE_REG32(MCANx->TXBC, 0x0U);
    WRITE_REG32(MCANx->TXESC, 0x0U);
    WRITE_REG32(MCANx->TXBAR, 0x0U);
    WRITE_REG32(MCANx->TXBCR, 0x0U);
    WRITE_REG32(MCANx->TXBTIE, 0x0U);
    WRITE_REG32(MCANx->TXBCIE, 0x0U);
    WRITE_REG32(MCANx->TXEFC, 0x0U);
}

/**
 * @brief Leave the initialization mode and start the MCAN module.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval None
 */
void MCAN_Start(CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_INIT);
}

/**
 * @brief Stop the MCAN module and enable access to configuration registers.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_TIMEOUT:          Operation timeout.
 */
int32_t MCAN_Stop(CM_MCAN_TypeDef *MCANx)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32Counter = 0U;

