RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    /* Request initialization */
    SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_INIT);
    /* Wait until the CCCR.INIT bit is set */
    while (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_INIT) == 0U) {
        u32Counter++;
        if (u32Counter > MCAN_TIMEOUT_COUNT) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
    }

    /* Exit from sleep mode */
    if (i32Ret == LL_OK) {
        u32Counter = 0U;
        /* Exit from sleep mode */
        CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSR);
        /* Wait until MCAN exits sleep mode */
        while (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSA) == MCAN_CCCR_CSA) {
            u32Counter++;
            if (u32Counter > MCAN_TIMEOUT_COUNT) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
        }
    }

    if (i32Ret == LL_OK) {
        /* Enable configuration change */
        SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CCE);
    }

    return i32Ret;
}

/**
 * @brief Enter MCAN peripheral in sleep mode.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_TIMEOUT:          Operation timeout.
 */
int32_t MCAN_EnterSleepMode(CM_MCAN_TypeDef *MCANx)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32TimeoutValue = MCAN_TIMEOUT_VALUE;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    /* Request clock stop */
    SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSR);
    /* Wait until MCAN is ready for sleep */
    while (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSA) == 0U) {
        u32TimeoutValue--;
        if (u32TimeoutValue == 0U) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
    }

    return i32Ret;
}

/**
 * @brief Exit sleep mode.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_TIMEOUT:          Operation timeout.
 */
int32_t MCAN_ExitSleepMode(CM_MCAN_TypeDef *MCANx)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32TimeoutValue = MCAN_TIMEOUT_VALUE;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    /* Reset clock stop request */
    CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSR);
    /* Wait until MCAN exits sleep mode */
    while (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_CSA) == MCAN_CCCR_CSA) {
        u32TimeoutValue--;
        if (u32TimeoutValue == 0U) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
    }

    if (i32Ret == LL_OK) {
        /* Enter normal operation */
        CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_INIT);
    }

    return i32Ret;
}

/**
 * @brief Get the address of each element that allocated into the message RAM
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pstcAddr               Pointer to a @ref stc_mcan_msg_ram_addr_t type structure
 *                                      which contains the message RAM configuration information.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcMcanInit == NULL.
 */
int32_t MCAN_GetMsgRamAddr(const CM_MCAN_TypeDef *MCANx, stc_mcan_msg_ram_addr_t *pstcAddr)
{
    uint32_t i;
    uint32_t u32ElementNum;
    uint32_t u32ElementSize;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (pstcAddr != NULL) {
        /* Get start address */
        pstcAddr->u32StdFilterStartAddr = MCAN_STD_FILTER_SA(MCANx);
        pstcAddr->u32ExtFilterStartAddr = MCAN_EXT_FILTER_SA(MCANx);
        pstcAddr->u32RxFifo0StartAddr   = MCAN_RX_FIFO0_SA(MCANx);
        pstcAddr->u32RxFifo1StartAddr   = MCAN_RX_FIFO1_SA(MCANx);
        pstcAddr->u32RxBufferStartAddr  = MCAN_RX_BUF_SA(MCANx);
        pstcAddr->u32TxEventStartAddr   = MCAN_TX_EVT_FIFO_SA(MCANx);
        pstcAddr->u32TxBufferStartAddr  = MCAN_TX_ELMT_SA(MCANx);
        u32ElementNum = MCAN_GET_TX_BUF_NUM(MCANx);
        pstcAddr->u32TxFifoQueueStartAddr = pstcAddr->u32TxBufferStartAddr + u32ElementNum * MCAN_TX_ES(MCANx);
        u32ElementNum = MCAN_GET_TX_FQ_NUM(MCANx);
        pstcAddr->u32EndAddr = pstcAddr->u32TxFifoQueueStartAddr + u32ElementNum * MCAN_TX_ES(MCANx);

        /* Get each standard filter element address. */
        if (pstcAddr->pu32StdFilterAddrList != NULL) {
            u32ElementNum = MCAN_GET_STD_FILTER_NUM(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32StdFilterAddrList[i] = pstcAddr->u32StdFilterStartAddr + i * MCAN_STD_FILTER_ES;
            }
        }
        /* Get each extended filter element address. */
        if (pstcAddr->pu32ExtFilterAddrList != NULL) {
            u32ElementNum = MCAN_GET_EXT_FILTER_NUM(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32ExtFilterAddrList[i] = pstcAddr->u32ExtFilterStartAddr + i * MCAN_EXT_FILTER_ES;
            }
        }
        /* Get each Rx FIFO0 element address. */
        if (pstcAddr->pu32RxFifo0AddrList != NULL) {
            u32ElementNum  = MCAN_GET_RX_FIFO0_NUM(MCANx);
            u32ElementSize = MCAN_RX_FIFO0_ES(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32RxFifo0AddrList[i] = pstcAddr->u32RxFifo0StartAddr + i * u32ElementSize;
            }
        }
        /* Get each Rx FIFO1 element address. */
        if (pstcAddr->pu32RxFifo1AddrList != NULL) {
            u32ElementNum  = MCAN_GET_RX_FIFO1_NUM(MCANx);
            u32ElementSize = MCAN_RX_FIFO1_ES(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32RxFifo1AddrList[i] = pstcAddr->u32RxFifo1StartAddr + i * u32ElementSize;
            }
        }
        /* Get each Rx buffer element address. */
        if (pstcAddr->pu32RxBufferAddrList != NULL) {
            u32ElementNum  = MCAN_GetRxBufferNum(MCANx);
            u32ElementSize = MCAN_RX_BUF_ES(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32RxBufferAddrList[i] = pstcAddr->u32RxBufferStartAddr + i * u32ElementSize;
            }
        }
        /* Get each Tx event FIFO element address. */
        if (pstcAddr->pu32TxEventAddrList != NULL) {
            u32ElementNum  = MCAN_GET_TX_EVT_FIFO_NUM(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32TxEventAddrList[i] = pstcAddr->u32TxEventStartAddr + i * MCAN_TX_EVT_ES;
            }
        }
        /* Get each dedicated Tx buffer element address. */
        if (pstcAddr->pu32TxBufferAddrList != NULL) {
            u32ElementNum  = MCAN_GET_TX_BUF_NUM(MCANx);
            u32ElementSize = MCAN_TX_ES(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32TxBufferAddrList[i] = pstcAddr->u32TxBufferStartAddr + i * u32ElementSize;
            }
        }
        /* Get each Tx FIFO/Queue element address. */
        if (pstcAddr->pu32TxFifoQueueAddrList != NULL) {
            u32ElementNum  = MCAN_GET_TX_FQ_NUM(MCANx);
            u32ElementSize = MCAN_TX_ES(MCANx);
            for (i = 0U; i < u32ElementNum; i++) {
                pstcAddr->pu32TxFifoQueueAddrList[i] = pstcAddr->u32TxFifoQueueStartAddr + i * u32ElementSize;
            }
        }

