RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Configure a reception filter element in the message RAM according to the specified parameters
 *        in the stc_mcan_filter_t structure.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pstcFilter             Pointer to a @ref stc_mcan_filter_t structure that
 *                                      contains the filter configuration information.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcFilter == NULL.
 * @note Call this API after message RAM configured.
 */
int32_t MCAN_FilterConfig(const CM_MCAN_TypeDef *MCANx, const stc_mcan_filter_t *pstcFilter)
{
    uint32_t u32F0;
    uint32_t u32F1;
    uint32_t *pu32FilterMem;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (pstcFilter != NULL) {
        i32Ret = LL_OK;
        DDL_ASSERT(IS_MCAN_ID_TYPE(pstcFilter->u32IdType));
        DDL_ASSERT(IS_MCAN_FILTER_CFG(pstcFilter->u32FilterConfig));
        if (pstcFilter->u32FilterConfig == MCAN_FILTER_TO_RX_BUF) {
            DDL_ASSERT(pstcFilter->u32RxBufferIndex < MCAN_GetRxBufferNum(MCANx));
        }

        /* Build filter configuration value */
        if (pstcFilter->u32IdType == MCAN_STD_ID) {
            /* Configures the standard ID filter element */
            DDL_ASSERT(pstcFilter->u32FilterIndex < MCAN_GET_STD_FILTER_NUM(MCANx));
            DDL_ASSERT(IS_MCAN_STD_ID_VAL(pstcFilter->u32FilterId1));

            /* Build the filter element */
            if (pstcFilter->u32FilterConfig == MCAN_FILTER_TO_RX_BUF) {
                u32F0 = ((pstcFilter->u32FilterConfig << MCAN_FILTER_SFCFG_POS) | \
                         (pstcFilter->u32FilterId1 << MCAN_FILTER_SFID1_POS)    | \
                         pstcFilter->u32RxBufferIndex);
            } else {
                DDL_ASSERT(IS_MCAN_STD_FILTER_TYPE(pstcFilter->u32FilterType));
                DDL_ASSERT(IS_MCAN_STD_ID_VAL(pstcFilter->u32FilterId2));
                u32F0 = ((pstcFilter->u32FilterType << MCAN_FILTER_SFTYPE_POS)  | \
                         (pstcFilter->u32FilterConfig << MCAN_FILTER_SFCFG_POS) | \
                         (pstcFilter->u32FilterId1 << MCAN_FILTER_SFID1_POS)    | \
                         pstcFilter->u32FilterId2);
            }

            /* Calculate filter address */
            pu32FilterMem = (uint32_t *)(MCAN_STD_FILTER_SA(MCANx) + (pstcFilter->u32FilterIndex * MCAN_STD_FILTER_ES));

            /* Write filter element to the message RAM */
            pu32FilterMem[0] = u32F0;
        } else {
            /* Configures the extended ID filter element */
            DDL_ASSERT(pstcFilter->u32FilterIndex < MCAN_GET_EXT_FILTER_NUM(MCANx));
            DDL_ASSERT(IS_MCAN_EXT_ID_VAL(pstcFilter->u32FilterId1));

            /* Build the first word of the filter element */
            u32F0 = ((pstcFilter->u32FilterConfig << MCAN_FILTER_EFCFG_POS) | pstcFilter->u32FilterId1);

            /* Build the second word of the filter element */
            if (pstcFilter->u32FilterConfig == MCAN_FILTER_TO_RX_BUF) {
                u32F1 = pstcFilter->u32RxBufferIndex;
            } else {
                DDL_ASSERT(IS_MCAN_EXT_FILTER_TYPE(pstcFilter->u32FilterType));
                DDL_ASSERT(IS_MCAN_EXT_ID_VAL(pstcFilter->u32FilterId2));
                u32F1 = ((pstcFilter->u32FilterType << MCAN_FILTER_EFTYPE_POS) | pstcFilter->u32FilterId2);
            }

            /* Calculate filter address */
            pu32FilterMem = (uint32_t *)(MCAN_EXT_FILTER_SA(MCANx) + (pstcFilter->u32FilterIndex * MCAN_EXT_FILTER_ES));

            /* Write filter element to the message RAM */
            pu32FilterMem[0U] = u32F0;
            pu32FilterMem[1U] = u32F1;
        }
    }

    return i32Ret;
}

/**
 * @brief Configures the MCAN global filter.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32StdNmfOperation      The operation of non-matching standard frame.
 *                                      This parameter can be a value of @ref MCAN_NMF_Operation
 *   @arg  MCAN_NMF_ACCEPT_IN_RX_FIFO0: Accept non-matching standard frames in Rx FIFO0.
 *   @arg  MCAN_NMF_ACCEPT_IN_RX_FIFO1: Accept non-matching standard frames in Rx FIFO1.
 *   @arg  MCAN_NMF_REJECT:             Reject all non-matching standard frames.
 * @param  [in] u32ExtNmfOperation      The operation of non-matching extended frame.
 *                                      This parameter can be a value of @ref MCAN_NMF_Operation
 *   @arg  MCAN_NMF_ACCEPT_IN_RX_FIFO0: Accept non-matching extended frames in Rx FIFO0.
 *   @arg  MCAN_NMF_ACCEPT_IN_RX_FIFO1: Accept non-matching extended frames in Rx FIFO1.
 *   @arg  MCAN_NMF_REJECT:             Reject all non-matching extended frames.
 * @param  [in] u32StdRemoteOperation   The operation of standard remote frame.
 *                                      This parameter can be a value of @ref MCAN_Remote_Frame_Operation
 *   @arg  MCAN_REMOTE_FRAME_FILTER:    Filter standard remote frames with ID.
 *   @arg  MCAN_REMOTE_FRAME_REJECT:    Reject all standard remote frames.
 * @param  [in] u32ExtRemoteOperation   The operation of extended remote frame.
 *                                      This parameter can be a value of @ref MCAN_Remote_Frame_Operation
 *   @arg  MCAN_REMOTE_FRAME_FILTER:    Filter extended remote frames with ID.
 *   @arg  MCAN_REMOTE_FRAME_REJECT:    Reject all extended remote frames.
 * @retval None
 */
void MCAN_GlobalFilterConfig(CM_MCAN_TypeDef *MCANx, \
                             uint32_t u32StdNmfOperation, uint32_t u32ExtNmfOperation, \
                             uint32_t u32StdRemoteOperation, uint32_t u32ExtRemoteOperation)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_NMF_OP(u32StdNmfOperation));
    DDL_ASSERT(IS_MCAN_NMF_OP(u32ExtNmfOperation));
    DDL_ASSERT(IS_MCAN_REMOTE_FRAME_OP(u32StdRemoteOperation));
    DDL_ASSERT(IS_MCAN_REMOTE_FRAME_OP(u32ExtRemoteOperation));

