RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    WRITE_REG32(MCANx->GFC, ((u32StdNmfOperation << MCAN_GFC_ANFS_POS)   | \
                             (u32ExtNmfOperation << MCAN_GFC_ANFE_POS)    | \
                             (u32StdRemoteOperation << MCAN_GFC_RRFS_POS) | \
                             (u32ExtRemoteOperation << MCAN_GFC_RRFE_POS)));
}

/**
 * @brief Set the extended ID mask.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32Mask                 Extended ID AND(logic AND operation) mask.
 *                                      This parameter must be a number between 0 and 0x1FFFFFFF.
 *                                      For acceptance filtering of extended frames the extended ID AND
 *                                      mask is ANDed with the message ID of a received frame. With the
 *                                      reset value of all bits set to one(0x1FFFFFFF) the mask is not active.
 * @retval None
 */
void MCAN_SetExtIDMask(CM_MCAN_TypeDef *MCANx, uint32_t u32Mask)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_EXT_ID_VAL(u32Mask));
    WRITE_REG32(MCANx->XIDAM, u32Mask);
}

/**
 * @brief Configures the Rx FIFO operation mode.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32RxFifo               Rx FIFO.
 *                                      This parameter can be one of the following values:
 *   @arg  MCAN_RX_FIFO0:               Rx FIFO0
 *   @arg  MCAN_RX_FIFO1:               Rx FIFO1
 * @param  [in] u32OperationMode        Rx FIFO operation mode.
 *                                      This parameter can be one of @ref MCAN_Rx_Fifo_Operation_Mode
 *   @arg  MCAN_RX_FIFO_BLOCKING:       Rx FIFO blocking mode.
 *                                      New received message will not be stored.
 *   @arg  MCAN_RX_FIFO_OVERWRITE:      Rx FIFO overwrite mode.
 *                                      New received message will overwrite the oldest received message.
 * @retval None
 */
void MCAN_RxFifoOperationModeConfig(CM_MCAN_TypeDef *MCANx, uint32_t u32RxFifo, uint32_t u32OperationMode)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_RX_FIFO(u32RxFifo));
    DDL_ASSERT(IS_MCAN_RX_FIFO_MD(u32OperationMode));

    if (u32RxFifo == MCAN_RX_FIFO0) {
        /* Set Rx FIFO0 operation mode */
        MODIFY_REG32(MCANx->RXF0C, MCAN_RXF0C_F0OM, u32OperationMode);
    } else {
        /* Set Rx FIFO1 operation mode */
        MODIFY_REG32(MCANx->RXF1C, MCAN_RXF1C_F1OM, u32OperationMode);
    }
}

/**
 * @brief Set the watermark of the specified FIFO.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32Fifo                 FIFO that supports watermark interrupt.
 *                                      This parameter can be one of the following values:
 *   @arg  MCAN_WATERMARK_RX_FIFO0:     Rx FIFO0.
 *   @arg  MCAN_WATERMARK_RX_FIFO1:     Rx FIFO1.
 *   @arg  MCAN_WATERMARK_TX_EVT_FIFO:  Tx event FIFO.
 * @param  [in] u32Watermark            Level for FIFO watermark interrupt.
 *                                      This parameter must be a number between:
 *                                      - 0 and u32RxFifo0Num of @ref stc_mcan_msg_ram_config_t, if u32Fifo is MCAN_WATERMARK_RX_FIFO0
 *                                      - 0 and u32RxFifo1Num of @ref stc_mcan_msg_ram_config_t, if u32Fifo is MCAN_WATERMARK_RX_FIFO1
 *                                      - 0 and u32TxEventNum of @ref stc_mcan_msg_ram_config_t, if u32Fifo is MCAN_WATERMARK_TX_EVT_FIFO
 * @retval None
 * @note   Call this API after message RAM configured.
 */
void MCAN_SetFifoWatermark(CM_MCAN_TypeDef *MCANx, uint32_t u32Fifo, uint32_t u32Watermark)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_WATERMARK_FIFO(u32Fifo));

    switch (u32Fifo) {
        case MCAN_WATERMARK_RX_FIFO0:
            /* Set Rx FIFO0 watermark */
            DDL_ASSERT(u32Watermark <= MCAN_GET_RX_FIFO0_NUM(MCANx));
            MODIFY_REG32(MCANx->RXF0C, MCAN_RXF0C_F0WM, (u32Watermark << MCAN_RXF0C_F0WM_POS));
            break;

        case MCAN_WATERMARK_RX_FIFO1:
            /* Set Rx FIFO1 watermark */
            DDL_ASSERT(u32Watermark <= MCAN_GET_RX_FIFO1_NUM(MCANx));
            MODIFY_REG32(MCANx->RXF1C, MCAN_RXF1C_F1WM, (u32Watermark << MCAN_RXF1C_F1WM_POS));
            break;

        case MCAN_WATERMARK_TX_EVT_FIFO:
            /* Set Tx event FIFO watermark */
            DDL_ASSERT(u32Watermark <= MCAN_GET_TX_EVT_FIFO_NUM(MCANx));
            MODIFY_REG32(MCANx->TXEFC, MCAN_TXEFC_EFWM, (u32Watermark << MCAN_TXEFC_EFWM_POS));
            break;

        default:
            break;
    }
}

/**
 * @brief Set the start value of the message RAM watchdog counter.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32StartValue           The start value of the message RAM watchdog counter.
 *                                      This parameter must be a number between 0x00 and 0xFF,
 *                                      with the reset value of 0x00 the counter is disabled.
 * @retval None
 */
void MCAN_RamWatchdogConfig(CM_MCAN_TypeDef *MCANx, uint32_t u32StartValue)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_RAM_WDT_START_VAL(u32StartValue));

