RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    /* Set the message RAM watchdog counter start value */
    MODIFY_REG32(MCANx->RWD, MCAN_RWD_WDC, u32StartValue);
}

/**
 * @brief Get the actual message RAM watchdog counter value.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint8_t type value of the actual message RAM watchdog counter value.
 */
uint8_t MCAN_GetRamWatchdogCountValue(const CM_MCAN_TypeDef *MCANx)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    return (uint8_t)(READ_REG32_BIT(MCANx->RWD, MCAN_RWD_WDV) >> MCAN_RWD_WDV_POS);
}

/**
 * @brief Configures MCAN timestamp.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32TsPrescaler          Timestamp counter prescaler.
 *                                      This parameter must be a value between 1 and 16.
 * @retval None
 */
void MCAN_TimestampCounterConfig(CM_MCAN_TypeDef *MCANx, uint32_t u32TsPrescaler)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_TS_PRESC(u32TsPrescaler));

    /* Set timestamp prescaler */
    MODIFY_REG32(MCANx->TSCC, MCAN_TSCC_TCP, (u32TsPrescaler - 1U) << MCAN_TSCC_TCP_POS);
}

/**
 * @brief Enable or disable the timestamp counter.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable timestamp counter.
 *   @arg  DISABLE:                     Disable timestamp counter.
 * @retval None
 */
void MCAN_TimestampCounterCmd(CM_MCAN_TypeDef *MCANx, en_functional_state_t enNewState)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        /* Enable timestamp counter */
        SET_REG32_BIT(MCANx->TSCC, MCAN_TSCC_TSS_0);
    } else {
        /* Disable timestamp counter */
        CLR_REG32_BIT(MCANx->TSCC, MCAN_TSCC_TSS);
    }
}

/**
 * @brief Get the timestamp counter value.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint16_t type value of timestamp counter.
 */
uint16_t MCAN_GetTimestampCounter(const CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return (uint16_t)(MCANx->TSCV);
}

/**
 * @brief Reset the timestamp counter to zero.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval None
 */
void MCAN_ResetTimestampCounter(CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    /* Reset timestamp counter. */
    CLR_REG32(MCANx->TSCV);
}

/**
 * @brief Set the watermark of the specified FIFO.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in] u32ToSelect             Timeout select.
 *                                      This parameter can be one of @ref MCAN_Timeout_Select
 *   @arg  MCAN_TIMEOUT_CONT:           Timeout continuous operation.
 *   @arg  MCAN_TIMEOUT_TX_EVT_FIFO:    Timeout controlled by Tx event FIFO.
 *   @arg  MCAN_TIMEOUT_RX_FIFO0:       Timeout controlled by Rx FIFO0.
 *   @arg  MCAN_TIMEOUT_RX_FIFO1:       Timeout controlled by Rx FIFO1.
 * @param  [in] u32ToPeriod             Start value of the timeout counter.Configures the Timeout Period.
 *                                      This parameter must be a number between 0x0000 and 0xFFFF
 * @retval None
 */
void MCAN_TimeoutCounterConfig(CM_MCAN_TypeDef *MCANx, uint32_t u32ToSelect, uint32_t u32ToPeriod)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_TO_SEL(u32ToSelect));
    DDL_ASSERT(IS_MCAN_TO_PERIOD(u32ToPeriod));

    /* Select timeout operation and configure period */
    MODIFY_REG32(MCANx->TOCC, (MCAN_TOCC_TOS | MCAN_TOCC_TOP),
                 (u32ToSelect | (u32ToPeriod << MCAN_TOCC_TOP_POS)));
}

/**
 * @brief Enable or disable the timeout counter.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable timeout counter.
 *   @arg  DISABLE:                     Disable timeout counter.
 * @retval None
 */
void MCAN_TimeoutCounterCmd(CM_MCAN_TypeDef *MCANx, en_functional_state_t enNewState)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        /* Enable timeout counter */
        SET_REG32_BIT(MCANx->TOCC, MCAN_TOCC_ETOC);
    } else {
        /* Disable timeout counter */
        CLR_REG32_BIT(MCANx->TOCC, MCAN_TOCC_ETOC);
    }
}

/**
 * @brief Get the timeout counter value.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint16_t type value of timeout counter.
 */
uint16_t MCAN_GetTimeoutCounter(const CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return (uint16_t)(MCANx->TOCV);
}

/**
 * @brief Reset the timeout counter to its start value.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval None
 */
void MCAN_ResetTimeoutCounter(CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (READ_REG32_BIT(MCANx->TOCC, MCAN_TOCC_TOS) == MCAN_TIMEOUT_CONT) {
        /* Reset timeout counter to start value */
        CLR_REG32(MCANx->TOCV);
    }
}

/**
 * @brief Configure the transmitter delay compensation
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32SspOffset           Transmitter delay compensation offset.
 * @param  [in]  u32TdcFilter           Transmitter delay compensation filter window length.
 *                                      This parameter must be a number between 0x00 and 0x7F
 * @retval None
 */
void MCAN_TxDelayCompensationConfig(CM_MCAN_TypeDef *MCANx, uint32_t u32SspOffset, uint32_t u32TdcFilter)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_SSP(u32SspOffset));
    DDL_ASSERT(IS_MCAN_TDC_FILTER(u32TdcFilter));

    /* Configure TDC offset and filter window */
    WRITE_REG32(MCANx->TDCR, ((u32SspOffset << MCAN_TDCR_TDCO_POS) | (u32TdcFilter << MCAN_TDCR_TDCF_POS)));
}

/**
 * @brief Enable or disable the transmitter delay compensation.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable transmitter delay compensation.
 *   @arg  DISABLE:                     Disable transmitter delay compensation.
 * @retval None
 */
void MCAN_TxDelayCompensationCmd(CM_MCAN_TypeDef *MCANx, en_functional_state_t enNewState)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        /* Enable transmitter delay compensation */
        SET_REG32_BIT(MCANx->DBTP, MCAN_DBTP_TDC);
    } else {
        /* Disable transmitter delay compensation */
        CLR_REG32_BIT(MCANx->DBTP, MCAN_DBTP_TDC);
    }
}

/**
 * @brief Specifies the CAN frame format.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32FrameFormat         CAN frame format.
 *                                      This parameter can be a value of @ref MCAN_Frame_Format
 *   @arg  MCAN_FRAME_CLASSIC:          Classic CAN mode.
 *   @arg  MCAN_FRAME_ISO_FD_NO_BRS:    ISO CAN FD mode without bit rate switching.
 *   @arg  MCAN_FRAME_ISO_FD_BRS:       ISO CAN FD mode with bit rate switching.
 *   @arg  MCAN_FRAME_NON_ISO_FD_NO_BRS: Non-ISO CAN FD mode without bit rate switching.
 *   @arg  MCAN_FRAME_NON_ISO_FD_BRS:   Non-ISO CAN FD mode with bit rate switching.
 * @retval None
 */
void MCAN_SetFrameFormat(CM_MCAN_TypeDef *MCANx, uint32_t u32FrameFormat)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_FRAME_FORMAT(u32FrameFormat));

