RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    MODIFY_REG32(MCANx->CCCR, MCAN_FRAME_NON_ISO_FD_BRS, u32FrameFormat);
}

/**
 * @brief Enable or disable the edge filtering during bus integration.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable edge filtering.
 *   @arg  DISABLE:                     Disable edge filtering.
 * @retval None
 */
void MCAN_EdgeFilteringCmd(CM_MCAN_TypeDef *MCANx, en_functional_state_t enNewState)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        /* Enable edge filtering */
        SET_REG32_BIT(MCANx->CCCR, MCAN_CCCR_EFBI);
    } else {
        /* Disable edge filtering */
        CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_EFBI);
    }
}

/**
 * @brief Config message marker for Tx event
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32MsgMarker           Message marker configuration.
 *   @arg  MCAN_MSG_MARKER_8BIT:        8-bit message marker used.
 *   @arg  MCAN_MSG_MARKER_16BIT:       16-bit Message Marker used, replacing 16-bit timestamps in Tx Event FIFO.
 * @retval None
 */
void MCAN_TxEventMsgMarkerConfig(CM_MCAN_TypeDef *MCANx, uint32_t u32MsgMarker)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_MSG_MARKER_CFG(u32MsgMarker));

    MODIFY_REG32(MCANx->CCCR, MCAN_CCCR_WMM, u32MsgMarker);
}

/**
 * @brief Add a message to the Tx FIFO/Queue and activate the corresponding transmission request.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pTxMsg                 Pointer to a @ref stc_mcan_tx_msg_t structure that contains
 *                                      the information of the message that to be transmitted.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pTxMsg == NULL.
 *                                      Tx FIFO/queue has an allocated area into the message RAM.
 *                                      Size of the message data payload is bigger than the configured value.
 *           - LL_ERR_BUF_FULL:         Tx FIFO/queue is full.
 */
int32_t MCAN_AddMsgToTxFifoQueue(CM_MCAN_TypeDef *MCANx, stc_mcan_tx_msg_t *pTxMsg)
{
    uint32_t u32TxPutIndex;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    if (pTxMsg != NULL) {
        DDL_ASSERT(IS_MCAN_ID_TYPE(pTxMsg->IDE));
        if (pTxMsg->IDE == MCAN_STD_ID) {
            DDL_ASSERT(IS_MCAN_STD_ID_VAL(pTxMsg->ID));
        } else {
            DDL_ASSERT(IS_MCAN_EXT_ID_VAL(pTxMsg->ID));
        }
        DDL_ASSERT(IS_MCAN_FRAME_RTR(pTxMsg->RTR));
        DDL_ASSERT(IS_MCAN_FRAME_DLC(pTxMsg->DLC));
        DDL_ASSERT(IS_MCAN_FRAME_ESI(pTxMsg->ESI));
        DDL_ASSERT(IS_MCAN_FRAME_BRS(pTxMsg->BRS));
        DDL_ASSERT(IS_MCAN_FRAME_FDF(pTxMsg->FDF));
        DDL_ASSERT(IS_MCAN_FRAME_EFC(pTxMsg->u32StoreTxEvent));
        u32TxPutIndex = READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_WMM);
        DDL_ASSERT(IS_MCAN_FRAME_MSG_MARKER(u32TxPutIndex, pTxMsg->u32MsgMarker));

        /* Check that the Tx FIFO/Queue has an allocated area into the message RAM.
           Check that the data field size is not bigger than the configured value. */
        if (READ_REG32_BIT(MCANx->TXBC, MCAN_TXBC_TFQS) != 0U) {
            /* Check that the Tx FIFO/queue is not full */
            if (READ_REG32_BIT(MCANx->TXFQS, MCAN_TXFQS_TFQF) == 0U) {
                /* Retrieve the Tx FIFO put index */
                u32TxPutIndex = (READ_REG32_BIT(MCANx->TXFQS, MCAN_TXFQS_TFQPI) >> MCAN_TXFQS_TFQPI_POS);

                /* Add the message to the Tx FIFO/Queue */
                MCAN_CopyTxMsgToRam(MCANx, pTxMsg, u32TxPutIndex);

                /* Store the last Tx FIFO/queue request buffer index. */
                pTxMsg->u32LastTxFifoQueueRequest = 1UL << u32TxPutIndex;
                /* Activate the corresponding transmission request. */
                WRITE_REG32(MCANx->TXBAR, pTxMsg->u32LastTxFifoQueueRequest);

                i32Ret = LL_OK;
            } else {
                i32Ret = LL_ERR_BUF_FULL;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief Add a message to a dedicated Tx buffer.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  pTxMsg                 Pointer to a @ref stc_mcan_tx_msg_t structure that contains
 *                                      the information of the message that to be transmitted.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pTxMsg == NULL.
 *                                      The selected buffer has no allocated area into the message RAM.
 *                                      Size of the message data payload is bigger than the configured value.
 *           - LL_ERR_BUSY:             There is a transmission request pending for the selected buffer.
 */
int32_t MCAN_AddMsgToTxBuffer(CM_MCAN_TypeDef *MCANx, stc_mcan_tx_msg_t *pTxMsg)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;
    uint32_t u32TxPutIndex;
    uint32_t u32TxBufferNum;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    if (pTxMsg != NULL) {
        DDL_ASSERT(IS_MCAN_ID_TYPE(pTxMsg->IDE));
        if (pTxMsg->IDE == MCAN_STD_ID) {
            DDL_ASSERT(IS_MCAN_STD_ID_VAL(pTxMsg->ID));
        } else {
            DDL_ASSERT(IS_MCAN_EXT_ID_VAL(pTxMsg->ID));
        }
        DDL_ASSERT(IS_MCAN_FRAME_RTR(pTxMsg->RTR));
        DDL_ASSERT(IS_MCAN_FRAME_DLC(pTxMsg->DLC));
        DDL_ASSERT(IS_MCAN_FRAME_ESI(pTxMsg->ESI));
        DDL_ASSERT(IS_MCAN_FRAME_BRS(pTxMsg->BRS));
        DDL_ASSERT(IS_MCAN_FRAME_FDF(pTxMsg->FDF));
        DDL_ASSERT(IS_MCAN_FRAME_EFC(pTxMsg->u32StoreTxEvent));
        u32TxPutIndex = READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_WMM);
        DDL_ASSERT(IS_MCAN_FRAME_MSG_MARKER(u32TxPutIndex, pTxMsg->u32MsgMarker));
        DDL_ASSERT(IS_MCAN_1TXBUF(pTxMsg->u32TxBuffer));
        u32TxBufferNum = MCAN_GET_TX_BUF_NUM(MCANx);
        u32TxPutIndex  = GET_BIT_POS(pTxMsg->u32TxBuffer);
        DDL_ASSERT(u32TxPutIndex < u32TxBufferNum);

