RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
        /* Check that the selected buffer has an allocated area into the message RAM.
           Check that the data field size is not bigger than the configured value. */
        if (u32TxPutIndex < u32TxBufferNum) {
            /* Check that there is no transmission request pending for the selected buffer */
            if (READ_REG32_BIT(MCANx->TXBRP, pTxMsg->u32TxBuffer) == 0U) {
                /* Add the message to the Tx buffer */
                MCAN_CopyTxMsgToRam(MCANx, pTxMsg, u32TxPutIndex);
                i32Ret = LL_OK;
            } else {
                i32Ret = LL_ERR_BUSY;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief Enable transmission request of the specified Tx buffer(s).
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32TxBuffer            Tx buffer(s) location.
 *                                      This parameter can be any combination of @ref MCAN_Tx_Location
 * @retval None
 */
void MCAN_EnableTxBufferRequest(CM_MCAN_TypeDef *MCANx, uint32_t u32TxBuffer)
{
#ifdef __DEBUG
    uint32_t u32TxBufferNum;
#endif
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
#ifdef __DEBUG
    u32TxBufferNum  = MCAN_GET_TX_BUF_NUM(MCANx);
    u32TxBufferNum += MCAN_GET_TX_FQ_NUM(MCANx);
    if (u32TxBufferNum < MCAN_TX_ELMT_NUM_MAX) {
        DDL_ASSERT(IS_MCAN_BIT_MASK(u32TxBuffer, (1UL << u32TxBufferNum) - 1U));
    }
#endif

    /* Add transmission request */
    WRITE_REG32(MCANx->TXBAR, u32TxBuffer);
}

/**
 * @brief Abort the transmission request of the specified Tx buffer(s).
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32TxBuffer            Tx buffer(s) location.
 *                                      This parameter can be any combination of @ref MCAN_Tx_Location
 * @retval None
 */
void MCAN_AbortTxRequest(CM_MCAN_TypeDef *MCANx, uint32_t u32TxBuffer)
{
#ifdef __DEBUG
    uint32_t u32TxBufferNum;
#endif
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
#ifdef __DEBUG
    u32TxBufferNum  = MCAN_GET_TX_BUF_NUM(MCANx);
    u32TxBufferNum += MCAN_GET_TX_FQ_NUM(MCANx);
    if (u32TxBufferNum < MCAN_TX_ELMT_NUM_MAX) {
        DDL_ASSERT(IS_MCAN_BIT_MASK(u32TxBuffer, (1UL << u32TxBufferNum) - 1U));
    }
#endif

    /* Add cancellation request */
    WRITE_REG32(MCANx->TXBCR, u32TxBuffer);
}

/**
 * @brief Get a received frame from the Rx buffer/FIFO zone into the message RAM.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32RxLocation          Location of the received message to be read.
 *                                      This parameter can be a value of @ref MCAN_Rx_Location
 * @param  [out] pRxMsg                 Pointer to a @ref stc_mcan_rx_msg_t structure which is used to save
 *                                      the received frame.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pRxMsg == NULL;
 *                                      The selected Rx FIFO has no allocated area into the message RAM;
 *                                      The selected Rx buffer is out of range.
 *           - LL_ERR_BUF_EMPTY:        The selected Rx FIFO is empty.
 */
int32_t MCAN_GetRxMsg(CM_MCAN_TypeDef *MCANx, uint32_t u32RxLocation, stc_mcan_rx_msg_t *pRxMsg)
{
    uint32_t i;
    uint32_t u32RxRamAddr = 0U;
    uint32_t u32Tmp;
    uint32_t u32DataFiledSize = 0U;
    uint32_t u32RxGetIndex = 0U;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (pRxMsg != NULL) {
        i32Ret = LL_OK;
        if (u32RxLocation == MCAN_RX_FIFO0) {
            /* Check that the Rx FIFO0 has an allocated area into the message RAM */
            if (READ_REG32_BIT(MCANx->RXF0C, MCAN_RXF0C_F0S) == 0U) {
                i32Ret = LL_ERR_INVD_PARAM;
            }

            if (i32Ret == LL_OK) {
                /* Check that the Rx FIFO0 is not empty */
                if (READ_REG32_BIT(MCANx->RXF0S, MCAN_RXF0S_F0FL) == 0U) {
                    i32Ret = LL_ERR_BUF_EMPTY;
                }
            }

            if (i32Ret == LL_OK) {
                /* Calculate Rx FIFO0 element index*/
                u32RxGetIndex = (READ_REG32_BIT(MCANx->RXF0S, MCAN_RXF0S_F0GI) >> MCAN_RXF0S_F0GI_POS);

                /* Calculate Rx FIFO0 element address */
                u32RxRamAddr  = MCAN_RX_FIFO0_SA(MCANx);
                u32RxRamAddr += (u32RxGetIndex * MCAN_RX_FIFO0_ES(MCANx));

                /* Get the configured data filed size of Rx FIFO0 */
                u32DataFiledSize = MCAN_RX_FIFO0_REAL_DS(MCANx);
            }
        } else if (u32RxLocation == MCAN_RX_FIFO1) {
            /* Check that the Rx FIFO1 has an allocated area into the message RAM */
            if (READ_REG32_BIT(MCANx->RXF1C, MCAN_RXF1C_F1S) == 0U) {
                i32Ret = LL_ERR_INVD_PARAM;
            }

            if (i32Ret == LL_OK) {
                /* Check that the Rx FIFO1 is not empty */
                if (READ_REG32_BIT(MCANx->RXF1S, MCAN_RXF1S_F1FL) == 0U) {
                    i32Ret = LL_ERR_BUF_EMPTY;
                }
            }

            if (i32Ret == LL_OK) {
                /* Calculate Rx FIFO1 element index */
                u32RxGetIndex = (READ_REG32_BIT(MCANx->RXF1S, MCAN_RXF1S_F1GI) >> MCAN_RXF1S_F1GI_POS);

