RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
                /* Calculate Rx FIFO1 element address */
                u32RxRamAddr  = MCAN_RX_FIFO1_SA(MCANx);
                u32RxRamAddr += (u32RxGetIndex * MCAN_RX_FIFO1_ES(MCANx));

                /* Get the configured data filed size of Rx FIFO1 */
                u32DataFiledSize = MCAN_RX_FIFO1_REAL_DS(MCANx);
            }
        } else {
            /* Rx element is assigned to a dedicated Rx buffer.
               Check that the selected buffer has an allocated area into the message RAM. */
            if (u32RxLocation >= MCAN_GetRxBufferNum(MCANx)) {
                i32Ret = LL_ERR_INVD_PARAM;
            } else {
                /* Calculate Rx buffer address */
                u32RxRamAddr  = MCAN_RX_BUF_SA(MCANx);
                u32RxRamAddr += (u32RxLocation * MCAN_RX_BUF_ES(MCANx));

                /* Get the configured data filed size of Rx buffer */
                u32DataFiledSize = MCAN_RX_BUF_REAL_DS(MCANx);
            }
        }

        if (i32Ret == LL_OK) {
            /* Retrieve ID type */
            pRxMsg->IDE = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_XTD_MASK) >> MCAN_FRAME_XTD_POS;
            /* Retrieve ID type */
            if (pRxMsg->IDE == MCAN_STD_ID) {
                /* Standard ID element */
                pRxMsg->ID = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_STDID_MASK) >> MCAN_FRAME_STDID_POS;
            } else {
                /* Extended ID element */
                pRxMsg->ID = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_EXTID_MASK);
            }

            /* Retrieve Rx frame type */
            pRxMsg->RTR = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_RTR_MASK) >> MCAN_FRAME_RTR_POS;

            /* Retrieve ESI */
            pRxMsg->ESI = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_ESI_MASK) >> MCAN_FRAME_ESI_POS;

            /* Increment Rx memory pointer to second word of Rx FIFO element */
            u32RxRamAddr += 4UL;

            /* Retrieve Rx timestamp */
            pRxMsg->u32RxTimestamp = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_TS_MASK);

            /* Retrieve DLC */
            pRxMsg->DLC = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_DLC_MASK) >> MCAN_FRAME_DLC_POS;
            pRxMsg->u32DataSize = m_au8DLC2Size[pRxMsg->DLC];

            /* Retrieve BRS */
            pRxMsg->BRS = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_BRS_MASK) >> MCAN_FRAME_BRS_POS;

            /* Retrieve FDF */
            pRxMsg->FDF = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_FDF_MASK) >> MCAN_FRAME_FDF_POS;
            /* Determine the CAN frame format: classical CAN or FD CAN */
            if (pRxMsg->FDF == 0U) {
                /* Max 8 bytes for classical CAN */
                if (pRxMsg->u32DataSize > CAN20_DATA_SIZE_MAX) {
                    pRxMsg->u32DataSize = CAN20_DATA_SIZE_MAX;
                }
            } else {
                /* Max size of the stored data is the allocated size */
                if (pRxMsg->u32DataSize > u32DataFiledSize) {
                    pRxMsg->u32DataSize = u32DataFiledSize;
                }
            }

            /* Retrieve filter index */
            pRxMsg->u32FilterIndex = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_FIDX_MASK) >> MCAN_FRAME_FIDX_POS;

            /* Retrieve non-matching frame */
            pRxMsg->u32NmfFlag = READ_REG32_BIT(RW_MEM32(u32RxRamAddr), MCAN_FRAME_ANMF_MASK) >> MCAN_FRAME_ANMF_POS;

            /* Increment Rx memory pointer to payload of Rx FIFO element */
            /* Retrieve Rx payload */
            if (pRxMsg->RTR == 0U) {
                /* Read the Rx payload from the message RAM. */
                for (i = 0U; i < pRxMsg->u32DataSize; i += 4U) {
                    u32RxRamAddr += 4U;
                    u32Tmp = RW_MEM32(u32RxRamAddr);
                    pRxMsg->au8Data[i]      = (uint8_t)(u32Tmp);
                    pRxMsg->au8Data[i + 1U] = (uint8_t)(u32Tmp >> 8U);
                    pRxMsg->au8Data[i + 2U] = (uint8_t)(u32Tmp >> 16U);
                    pRxMsg->au8Data[i + 3U] = (uint8_t)(u32Tmp >> 24U);
                }
            }

            if (u32RxLocation == MCAN_RX_FIFO0) {
                /* Rx element is assigned to the Rx FIFO0.
                   Acknowledge the Rx FIFO0 that the oldest element
                   is read so that it increments the get index. */
                WRITE_REG32(MCANx->RXF0A, u32RxGetIndex);
            } else if (u32RxLocation == MCAN_RX_FIFO1) {
                /* Rx element is assigned to the Rx FIFO1.
                   Acknowledge the Rx FIFO1 that the oldest element
                   is read so that it increments the get index. */
                WRITE_REG32(MCANx->RXF1A, u32RxGetIndex);
            } else {
                /* Rx element is assigned to a dedicated Rx buffer.
                   Clear the new data flag of the current Rx buffer. */
                if (u32RxLocation < MCAN_RX_BUF32) {
                    WRITE_REG32(MCANx->NDAT1, (1UL << u32RxLocation));
                } else {
                    WRITE_REG32(MCANx->NDAT2, (1UL << (u32RxLocation & 0x1FUL)));
                }
            }
        }
    }

    return i32Ret;
}

/**
 * @brief Get a Tx event from the Tx event FIFO zone into the message RAM.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [out] pTxEvent               Pointer to a @ref stc_mcan_tx_event_t structure which is used to save
 *                                      the Tx event.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pTxEvent == NULL;
 *           - LL_ERR_BUF_EMPTY:        The Tx event FIFO is empty.
 */
int32_t MCAN_GetTxEvent(CM_MCAN_TypeDef *MCANx, stc_mcan_tx_event_t *pTxEvent)
{
    uint32_t u32TxEventAddr;
    uint32_t u32GetIndex;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (pTxEvent != NULL) {
        i32Ret = LL_OK;

