RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Get the TDC value that used by CAN FD frame transmission.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint8_t value between 0~127.
 */
uint8_t MCAN_GetTdcValue(const CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return (uint8_t)(READ_REG32_BIT(MCANx->PSR, MCAN_PSR_TDCV) >> MCAN_PSR_TDCV_POS);
}

/**
 * @brief Get the last error code of data phase(data bit time used).
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint8_t value of @ref MCAN_Protocol_Error_Code
 */
uint8_t MCAN_GetDataLastErrorCode(const CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return (uint8_t)(READ_REG32_BIT(MCANx->PSR, MCAN_PSR_DLEC) >> MCAN_PSR_DLEC_POS);
}

/**
 * @brief Get the last error code of classical CAN frame or CAN FD frame arbitraion phase(nominal bit time used).
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint8_t value of @ref MCAN_Protocol_Error_Code
 */
uint8_t MCAN_GetLastErrorCode(const CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return (uint8_t)READ_REG32_BIT(MCANx->PSR, MCAN_PSR_LEC);
}

/**
 * @brief Get the communication state.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint8_t value of @ref MCAN_Com_State
 */
uint8_t MCAN_GetComState(const CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return (uint8_t)(READ_REG32_BIT(MCANx->PSR, MCAN_PSR_ACT) >> MCAN_PSR_ACT_POS);
}

/**
 * @brief Get the status of the specified protocol flag.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32PsFlag              Protocol flag.
 *                                      This parameter can be any combination of @ref MCAN_Protocol_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t MCAN_GetProtocolFlagStatus(const CM_MCAN_TypeDef *MCANx, uint32_t u32PsFlag)
{
    en_flag_status_t enStatus = RESET;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_PS_FLAG(u32PsFlag));

    if (READ_REG32_BIT(MCANx->PSR, u32PsFlag) != 0U) {
        /* Return SET if one the specified flags is SET. */
        enStatus = SET;
    }

    return enStatus;
}

/**
 * @brief Get error counter values.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [out] pErrorCounter          Pointer to a @ref stc_mcan_error_counter_t structure which is used to save
 *                                      the error counter values.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pErrorCounter == NULL.
 */
int32_t MCAN_GetErrorCounter(const CM_MCAN_TypeDef *MCANx, stc_mcan_error_counter_t *pErrorCounter)
{
    uint32_t u32Counter;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (pErrorCounter != NULL) {
        /* Read the error counters register */
        u32Counter = READ_REG32(MCANx->ECR);

        /* Fill the error counters structure */
        pErrorCounter->u8TxErrorCount   = (uint8_t)(u32Counter & MCAN_ECR_TEC);
        pErrorCounter->u8RxErrorCount   = (uint8_t)((u32Counter & MCAN_ECR_REC) >> MCAN_ECR_REC_POS);
        pErrorCounter->u8RxErrorPassive = (uint8_t)((u32Counter & MCAN_ECR_RP) >> MCAN_ECR_RP_POS);
        pErrorCounter->u8ErrorLogging   = (uint8_t)((u32Counter & MCAN_ECR_CEL) >> MCAN_ECR_CEL_POS);

        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Get the status of the specified interrupt flag.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32Flag                MCAN interrupt flag.
 *                                      This parameter can be any combination of @ref MCAN_Interrupt_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t MCAN_GetStatus(const CM_MCAN_TypeDef *MCANx, uint32_t u32Flag)
{
    en_flag_status_t enStatus = RESET;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_FLAG(u32Flag));

    if (READ_REG32_BIT(MCANx->IR, u32Flag) != 0U) {
        /* Return SET if one the specified flags is SET. */
        enStatus = SET;
    }

