RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    return enStatus;
}

/**
 * @brief Clear the specified interrupt flag.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32Flag                MCAN interrupt flag.
 *                                      This parameter can be any combination of @ref MCAN_Interrupt_Flag
 * @retval None
 */
void MCAN_ClearStatus(CM_MCAN_TypeDef *MCANx, uint32_t u32Flag)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_FLAG(u32Flag));

    WRITE_REG32(MCANx->IR, u32Flag);
}

/**
 * @brief Get the transmission occurred buffer list.
 *        Each Tx buffer has its own transmission occurred bit. The bits are set when the corresponding
 *        TXBRP bit is cleared after a successful transmission.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint32_t type value.
 */
uint32_t MCAN_GetTxOccurredList(const CM_MCAN_TypeDef *MCANx)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    return READ_REG32(MCANx->TXBTO);
}

/**
 * @brief Get the cancellation occurred buffer list.
 *        Each Tx buffer has its own cancellation finished bit. The bits are set when the corresponding
 *        TXBRP bit is cleared after a cancellation was requested via TXBCR.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint32_t type value.
 */
uint32_t MCAN_GetTxAbortedList(const CM_MCAN_TypeDef *MCANx)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    return READ_REG32(MCANx->TXBCF);
}

/**
 * @brief Check if the transmission of the specified Tx buffer has occurred.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32TxBuffer            A Tx buffer.
 *                                      This parameter can be a value of @ref MCAN_Tx_Location
 * @retval int32_t:
 *           - LL_OK:                   The transmission of the specified Tx buffer has occurred.
 *           - LL_ERR_BUSY:             The transmission of the specified Tx buffer has not occurred.
 */
int32_t MCAN_CheckTxOccurred(const CM_MCAN_TypeDef *MCANx, uint32_t u32TxBuffer)
{
    int32_t i32Ret = LL_ERR_BUSY;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_1TXBUF(u32TxBuffer));

    if (READ_REG32_BIT(MCANx->TXBTO, u32TxBuffer) != 0U) {
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Check if the cancellation of the specified Tx buffer has occurred.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32TxBuffer            A Tx buffer.
 *                                      This parameter can be a value of @ref MCAN_Tx_Location
 * @retval int32_t:
 *           - LL_OK:                   The cancellation of the specified Tx buffer has occurred.
 *           - LL_ERR_BUSY:             The cancellation of the specified Tx buffer has not occurred.
 */
int32_t MCAN_CheckTxAborted(const CM_MCAN_TypeDef *MCANx, uint32_t u32TxBuffer)
{
    int32_t i32Ret = LL_ERR_BUSY;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_1TXBUF(u32TxBuffer));

    if (READ_REG32_BIT(MCANx->TXBCF, u32TxBuffer) != 0U) {
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Check if a new message is received in the selected Rx buffer.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32RxBufferIndex       Rx buffer index.
 *                                      This parameter must be a number between 0 and 63(MCAN_RX_BUF0~MCAN_RX_BUF63 of @ref MCAN_Rx_Location).
 * @retval int32_t:
 *           - LL_OK:                   A new message is received in the selected Rx buffer.
 *           - LL_ERR_INVD_PARAM:       u32RxBufferIndex is larger than the number of Rx buffer that allocated into the message RAM.
 *           - LL_ERR_BUF_EMPTY:        The selected Rx buffer is empty.
 */
int32_t MCAN_CheckRxBufferMsgAvailable(CM_MCAN_TypeDef *MCANx, uint32_t u32RxBufferIndex)
{
    uint32_t u32RxBufferNum;
    uint32_t u32RxBufferMask;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    u32RxBufferNum = MCAN_GetRxBufferNum(MCANx);
    DDL_ASSERT(u32RxBufferIndex < u32RxBufferNum);

    if (u32RxBufferIndex < u32RxBufferNum) {
        i32Ret = LL_ERR_BUF_EMPTY;
        if (u32RxBufferIndex < 32U) {
            u32RxBufferMask = 1UL << u32RxBufferIndex;
            if (READ_REG32_BIT(MCANx->NDAT1, u32RxBufferMask) != 0U) {
                WRITE_REG32(MCANx->NDAT1, u32RxBufferMask);
                i32Ret = LL_OK;
            }
        } else {
            u32RxBufferMask = 1UL << (u32RxBufferIndex & 0x1FUL);
            if (READ_REG32_BIT(MCANx->NDAT2, u32RxBufferMask) != 0U) {
                WRITE_REG32(MCANx->NDAT2, u32RxBufferMask);
                i32Ret = LL_OK;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief Check if a transmission request is pending on the selected Tx buffer.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32TxBuffer            Tx buffer(s).
 *                                      This parameter can be any combination of @ref MCAN_Tx_Location
 * @retval int32_t:
 *           - LL_OK:                   Pending transmission request on Tx buffer(s).
 *           - LL_ERR_BUF_EMPTY:        No pending transmission request on Tx buffer(s).
 */
int32_t MCAN_CheckTxBufferPending(const CM_MCAN_TypeDef *MCANx, uint32_t u32TxBuffer)
{
    int32_t i32Ret = LL_ERR_BUF_EMPTY;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

