RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
    /* Check pending transmission request on the selected buffer */
    if (READ_REG32_BIT(MCANx->TXBRP, u32TxBuffer) != 0U) {
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Get the fill level of the specified Rx FIFO.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32RxFifo              Rx FIFO.
 *                                      This parameter can be one of the following values:
 *   @arg  MCAN_RX_FIFO0:               Rx FIFO0
 *   @arg  MCAN_RX_FIFO1:               Rx FIFO1
 * @retval An uint32_t type value of the fill level.
 */
uint32_t MCAN_GetRxFifoFillLevel(const CM_MCAN_TypeDef *MCANx, uint32_t u32RxFifo)
{
    uint32_t u32FillLevel;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_RX_FIFO(u32RxFifo));

    if (u32RxFifo == MCAN_RX_FIFO0) {
        u32FillLevel = READ_REG32_BIT(MCANx->RXF0S, MCAN_RXF0S_F0FL);
    } else {
        u32FillLevel = READ_REG32_BIT(MCANx->RXF1S, MCAN_RXF1S_F1FL);
    }

    return u32FillLevel;
}

/**
 * @brief Get the Tx FIFO free level(number of consecutive free Tx FIFO).
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval An uint32_t type value of the Tx FIFO free level.
 */
uint32_t MCAN_GetTxFifoFreeLevel(const CM_MCAN_TypeDef *MCANx)
{
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    return READ_REG32_BIT(MCANx->TXFQS, MCAN_TXFQS_TFFL);
}

/**
 * @brief Check if the specified MCAN peripheral entered restricted operation mode.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval int32_t:
 *           - LL_OK:                   Restricted operation mode active.
 *           - LL_ERR:                  Normal operation mode.
 */
int32_t MCAN_CheckRestrictedOperationMode(const CM_MCAN_TypeDef *MCANx)
{
    int32_t i32Ret = LL_ERR;
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (READ_REG32_BIT(MCANx->CCCR, MCAN_CCCR_ASM) != 0U) {
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief Exit restricted operation mode.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval None
 */
void MCAN_ExitRestrictedOperationMode(CM_MCAN_TypeDef *MCANx)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    /* Exit Restricted Operation mode */
    CLR_REG32_BIT(MCANx->CCCR, MCAN_CCCR_ASM);
}

/**
 * @brief Get the Tx Buffer number of message whose transmission was started last.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval uint8_t:
 *          - 0-31:                     Tx buffer number.
 *          - 0xFF:                     Value of TEST.TXBNS not valid.
 */
uint8_t MCAN_GetStartedTxBufferNum(const CM_MCAN_TypeDef *MCANx)
{
    uint8_t u8TxBufferNum = 0xFFU;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    if (READ_REG32_BIT(MCANx->TEST, MCAN_TEST_SVAL) != 0U) {
        u8TxBufferNum = (uint8_t)(READ_REG32_BIT(MCANx->TEST, MCAN_TEST_TXBNS) >> MCAN_TEST_TXBNS_POS);
    }

    return u8TxBufferNum;
}

/**
 * @brief Get the Tx Buffer number of message that is ready for transmission.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval uint8_t:
 *          - 0-31:                     Tx buffer number.
 *          - 0xFF:                     Value of TEST.TXBNP not valid.
 */
uint8_t MCAN_GetPreparedTxBufferNum(const CM_MCAN_TypeDef *MCANx)
{
    uint8_t u8TxBufferNum = 0xFFU;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    if (READ_REG32_BIT(MCANx->TEST, MCAN_TEST_PVAL) != 0U) {
        u8TxBufferNum = (uint8_t)(READ_REG32_BIT(MCANx->TEST, MCAN_TEST_TXBNP) >> MCAN_TEST_TXBNP_POS);
    }

    return u8TxBufferNum;
}

/**
 * @brief Get the logical state of the bus.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @retval uint8_t:
 *          - 0:                        The CAN bus is dominant.
 *          - 1:                        The CAN bus is recessive.
 */
uint8_t MCAN_GetBusLogicalState(const CM_MCAN_TypeDef *MCANx)
{
    uint8_t u8LogicalState = 0U;

    DDL_ASSERT(IS_MCAN_UNIT(MCANx));

    if (READ_REG32_BIT(MCANx->TEST, MCAN_TEST_RX) != 0U) {
        u8LogicalState = 1U;
    }

    return u8LogicalState;
}

/**
 * @brief Control of transmit pin
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32PinCtrl             Control of transmit pin
 *                                      This parameter can be one of the following values:
 *   @arg  MCAN_TX_PIN_NORMAL:          Tx pin controlled by the CAN Core, updated at the end of the CAN bit time
 *   @arg  MCAN_TX_PIN_MONITOR:         Sample Point can be monitored at Tx pin
 *   @arg  MCAN_TX_PIN_DOMINANT:        Dominant ('0') level at Tx pin
 *   @arg  MCAN_TX_PIN_RECESSIVE:       Recessive ('1') level at Tx pin
 * @retval None
 */
void MCAN_TxPinControl(CM_MCAN_TypeDef *MCANx, uint32_t u32PinCtrl)
{
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_PIN_CTRL(u32PinCtrl));

    MODIFY_REG32(MCANx->TEST, MCAN_TEST_TX, u32PinCtrl);
}

/**
 * @brief Enable or disable the specifed interrupt(s) of the MCAN.
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32IntType             The MCAN interrupt(s).
 *                                      This parameter can be any combination of @ref MCAN_Interrupt
 * @param  [in]  u32IntLine             Interrupt line, indicates the specified interrupt(s) will be assigned to.
 *                                      This parameter can be a value of @ref MCAN_Interrupt_Line
 *   @arg  MCAN_INT_LINE0:              The specified interrupt(s) will be assigned to interrupt line 0 when enNewState is ENABLE.
 *   @arg  MCAN_INT_LINE1:              The specified interrupt(s) will be assigned to interrupt line 1 when enNewState is ENABLE.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable the specifed interrupt(s).
 *   @arg  DISABLE:                     Disable the specifed interrupt(s).
 * @retval None
 */
void MCAN_IntCmd(CM_MCAN_TypeDef *MCANx, uint32_t u32IntType, uint32_t u32IntLine, \
                 en_functional_state_t enNewState)
{
    uint32_t u32ILS;

    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
    DDL_ASSERT(IS_MCAN_INT_TYPE(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        DDL_ASSERT(IS_MCAN_INT_LINE(u32IntLine));

        SET_REG32_BIT(MCANx->IE, u32IntType);
        if (u32IntLine == MCAN_INT_LINE0) {
            CLR_REG32_BIT(MCANx->ILS, u32IntType);
            /* Enable interrupt line 0 */
            SET_REG32_BIT(MCANx->ILE, MCAN_INT_LINE0);
        } else {
            SET_REG32_BIT(MCANx->ILS, u32IntType);
            /* Enable interrupt line 1 */
            SET_REG32_BIT(MCANx->ILE, MCAN_INT_LINE1);
        }
    } else {
        CLR_REG32_BIT(MCANx->IE, u32IntType);
        u32ILS = MCANx->ILS;
        if ((MCANx->IE | u32ILS) == u32ILS) {
            /* Disable interrupt line 0 */
            CLR_REG32_BIT(MCANx->ILE, MCAN_INT_LINE0);
        }

