RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/hc32_ll_driver/src/hc32_ll_mcan.c
        if ((MCANx->IE & u32ILS) == 0U) {
            /* Disable interrupt line 1 */
            CLR_REG32_BIT(MCANx->ILE, MCAN_INT_LINE1);
        }
    }
}

/**
 * @brief Enable or disable the specifed notification(s) of the specifed Tx buffer(s).
 * @param  [in]  MCANx                  Pointer to MCAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_MCAN1:                    MCAN1 instance register base.
 *   @arg  CM_MCAN2:                    MCAN2 instance register base.
 * @param  [in]  u32TxBuffer            Tx buffer(s).
 *                                      This parameter can be any combination of @ref MCAN_Tx_Location
 * @param  [in]  u32Notification        Notification(s) of Tx buffer.
 *                                      This parameter can be any combination of the following parameters:
 *   @arg  MCAN_INT_TX_CPLT:            Transmission completed interrupt.
 *                                      The Tx buffer can cause transmission completed completed interrupt
 *                                      only when its own transmission completed interrupt is enabled.
 *   @arg  MCAN_INT_TX_ABORT_CPLT:      Transmission cancellation finished interrupt.
 *                                      The Tx buffer can cause transmission cancellation finished interrupt
 *                                      only when its own transmission cancellation finished interrupt is enabled.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable the specifed interrupt(s).
 *   @arg  DISABLE:                     Disable the specifed interrupt(s).
 * @retval None
 */
void MCAN_TxBufferNotificationCmd(CM_MCAN_TypeDef *MCANx, uint32_t u32TxBuffer, \
                                  uint32_t u32Notification, en_functional_state_t enNewState)
{
#ifdef __DEBUG
    uint32_t u32TxBufferNum;
#endif
    /* Check function parameters */
    DDL_ASSERT(IS_MCAN_UNIT(MCANx));
#ifdef __DEBUG
    u32TxBufferNum  = MCAN_GET_TX_BUF_NUM(MCANx);
    u32TxBufferNum += MCAN_GET_TX_FQ_NUM(MCANx);
    if (u32TxBufferNum < MCAN_TX_ELMT_NUM_MAX) {
        DDL_ASSERT(IS_MCAN_BIT_MASK(u32TxBuffer, (1UL << u32TxBufferNum) - 1U));
    }
#endif
    DDL_ASSERT(IS_MCAN_TX_BUF_NOTICE(u32Notification));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        if ((u32Notification & MCAN_INT_TX_CPLT) != 0U) {
            /* Enable Tx buffer transmission interrupt to set TC flag in IR register,
               but interrupt will only occur if TC is enabled in IE register */
            SET_REG32_BIT(MCANx->TXBTIE, u32TxBuffer);
        }

        if ((u32Notification & MCAN_INT_TX_ABORT_CPLT) != 0U) {
            /* Enable Tx buffer cancellation finished interrupt to set TCF flag in IR register,
               but interrupt will only occur if TCF is enabled in IE register */
            SET_REG32_BIT(MCANx->TXBCIE, u32TxBuffer);
        }
    } else {
        if ((u32Notification & MCAN_INT_TX_CPLT) != 0U) {
            /* Disable Tx buffer transmission interrupts */
            CLR_REG32_BIT(MCANx->TXBTIE, u32TxBuffer);
        }

        if ((u32Notification & MCAN_INT_TX_ABORT_CPLT) != 0U) {
            /* Disable Tx buffer cancellation finished interrupt */
            CLR_REG32_BIT(MCANx->TXBCIE, u32TxBuffer);
        }
    }
}

/**
 * @}
 */

#endif /* LL_MCAN_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
